ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         adpd4000_task.c
* @author       ADI
* @version      V1.0.0
* @date         17-April-2019
* @brief        Source file contains adpd processing wrapper.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/
#include <adpd4000_buffering.h>
#include <adpd4000_dcfg.h>
#include <adpd4000_task.h>
#include <adpd400x_reg.h>
#include <clock_calibration.h>
#include "adpd400x_lib.h"
#include "agc.h"
#include "app_common.h"
#ifdef ENABLE_BIA_APP
#include "bia_application_task.h"
#endif

#ifdef ENABLE_EDA_APP
#include "eda_application_task.h"
#endif
#include <ecg_application_interface.h>
#include <ecg_task.h>
#ifdef ENABLE_SQI_APP
#include "sqi_task.h"
#endif
#ifdef ENABLE_PPG_APP
#include <mw_ppg.h>
#include <struct_operations.h>
#endif
#include "lcm.h"
#include "nrf_log_ctrl.h"
#ifdef DCB
#include "adi_dcb_config.h"
#include <dcb_interface.h>
#endif
#include "power_manager.h"
#include "us_tick.h"
#include "app_sync.h"
#include "low_touch_task.h"
#include "ppg_application_interface.h"
/* System Task Module Log settings */
#include "nrf_log.h"
/*---------------------------- Defines --------------------------------------*/
#define MAX_PAYLOAD_BYTE 24
#define TOTAL_SLOT 12 /* total number of slots */
#define SAMPLE_NUM 1
#define ADPD_APP_ROUTING_TBL_SZ                                                \
  (sizeof(adpd4000_app_routing_table) / sizeof(adpd4000_app_routing_table[0]))
#define SECONDS_PER_MIN               60U   //! Number of seconds per minute

/*--------------------------- Typedef ---------------------------------------*/

/*!
 * @brief:  The dictionary type for mapping addresses to callback handlers.
 */
typedef m2m2_hdr_t *(app_cb_function_t)(m2m2_hdr_t *);

typedef struct _app_routing_table_entry_t {
  uint8_t command;
  app_cb_function_t *cb_handler;
} app_routing_table_entry_t;

/*------------------------------ Public Variable ----------------------------*/
slot_led_reg_t led_reg;
bool gAdpdPause = false;
uint32_t gAdpdIntCnt = 0;
volatile uint8_t gsOneTimeValueWhenReadAdpdData = 0;
uint8_t gsOneTimeValueWhenReadData = 0;
#ifdef ENABLE_SQI_APP
/* flag to check if adpd data is externally fed for sqi stream */
bool gAdpd_ext_data_stream_active = false;
/* odr for externally fed adpd data */
uint16_t gAdpd_ext_data_stream_odr = 50U;
#endif

/* Application status trace */
g_state_t g_state;
ADPD_TS_DATA_TYPE gADPD4000_dready_ts_prev, g_time_diff;
static uint16_t g_adpd_reg_base;
/****Flags to control AGC for 4 LEDs ****/
uint32_t gn_agc_active_slots;
static uint32_t gsAgcSampleCnt[SLOT_NUM];
static uint8_t gsAgcFlag = 0;
uint32_t gn_led_slot_g = 0;
uint32_t gn_led_slot_r = 0;
uint32_t gn_led_slot_ir = 0;
uint32_t gn_led_slot_b = 0;
bool gRun_agc = false;
static uint32_t gsResetStaticAgcSampleCnt = 0; //!< To count number of samples to recalibrate the signal
/*************************************/

/* flag to check if loadAdpdCfg cmd is used to load the adpd dcfg */
static bool external_load_dcfg = false;
/*
** All chips prior to DVT2 have chipID as 0xC0 corresponding to ADPD4000
** dvt2=0 --> older boards (nRF DK+ sensor board, EVT, DVT1)
** dvt2=1 --> DVT2 upwards
*/
uint8_t dvt2 = 0; /* whether DVT2 or not */

/* counter used to send every kth sample to temp task
   to have temp stream odr = 1Hz, where k = odr of adpd4k temp slot */
uint32_t gsTempSampleCount = 0;
#ifdef SLOT_SELECT
/* counter used to send every kth sample to ppg task
   to have ppg odr = 50Hz, where k = odr of adpd4k ppg slot */
uint32_t gsSampleCount1 = 0;
#endif
/* counter used to send every kth sample to HR algo
   to have ppg odr = 50Hz, where k = odr of adpd4k*/
uint32_t gnHRAdpdSampleCount = 0;
/* flag is set when sampling rate is changed */
volatile uint8_t gbAdpdSamplingRateChanged;
extern uint16_t gAdpdSlotMaxODR; /* Maximum ODR among of all the active slots */
#ifdef ENABLE_PPG_APP
extern Adpd400xLibConfig_t gAdpd400xLibCfg;
extern uint32_t gnHRAdxlSampleCount;
volatile uint8_t gn_uc_hr_enable = 0;
uint16_t gn_uc_hr_slot = ADPD4K_SLOT_F;
#endif

volatile uint8_t gb_adpd_multi_sub_start = 0; /* Flag to handle whether ADPD sensor was 'start'ed and multiple subscribers(more than 1) added to get raw data(CLI_USB/CLI_BLE)*/

/* assign the connected sensor, which can used other application task */
extern ADPD_TS_DATA_TYPE gADPD4000_dready_ts;
extern uint8_t nFifoStatusByte;
extern uint32_t nWriteSequnce;
uint16_t decimation_info[SLOT_NUM] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};
extern uint32_t gnLcmValue;
extern uint32_t nReadSequence;
extern uint32_t nInterruptSequence;
extern uint32_t nWriteSequence;
extern adpd400xDrv_slot_t gsSlot[SLOT_NUM];
extern uint8_t gnAdpdFifoWaterMark;
#ifdef ENABLE_PPG_APP
/* flag to check if agc ON for PPG or UC HR */
extern uint8_t gPpg_agc_en;
/*
following flag is set in two cases for PPG or UC HR
    - AGC is ON and AGC calibration done
    - AGC is OFF and Setting Default Curr/Gain from LCFG done
*/
extern uint8_t gPpg_agc_done;
extern uint32_t Ppg_Slot;
extern uint8_t gnFirstAGCcal;
extern volatile uint8_t gnAppSyncTimerStarted;
#endif
#ifdef ENABLE_TEMPERATURE_APP
extern uint32_t gnTemperature_Slot;
extern uint16_t gsTemperatureStarts;
#endif
extern agc_data_t agc_data[SLOT_NUM];
#ifdef ENABLE_BIA_APP
extern g_state_bia_t g_state_bia;
#endif
#ifdef ENABLE_ECG_APP
extern g_state_ecg_t g_state_ecg;
#endif
#ifdef ENABLE_EDA_APP
extern g_state_eda_t g_state_eda;
#endif
#ifdef ENABLE_SQI_APP
extern uint8_t sqi_event;
extern uint32_t gnSQI_Slot;
#endif
extern uint16_t g_adpd_odr; /**/
extern uint16_t get_adpd_odr();

