ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
#ifdef DCB
/* Reuse the gsConfigTmpFile[] RAM buffer used in system_task.c for
 * holding copy of either DCB/NAND config file which has LT
 * start/stop sequence of commands.
 * This buffer is to be reused between holding the copy of LT config file
 * as well as temporary storage for DCB content during READ/WRITE DCB block
 * for ADPD, Gen block DCB
 * Buffer to be shared between tasks( General Blk DCB & ADPD4000 DCB ) */
extern uint8_t gsConfigTmpFile[];
#endif

void get_agc_info(m2m2_adpd_agc_info_t *agc_info);
void reset_agc_flags(void);
#ifdef ENABLE_PPG_APP
static void update_ppg_default_current_gain(uint8_t slot_id);
#endif
/*------------------------------ Public Function Prototype ------------------ */
#ifdef ENABLE_PPG_APP
extern void RegisterPpgCB(int16_t (*pfppg_set_opmode)(uint8_t));
extern StructOpErrorStatus GetAdpd400xLcfgStructure(
    int32_t *pValue, uint8_t *nSize);

extern StructOpErrorStatus ReadAdpd400xLcfgStructureRaw(
    uint32_t field, int32_t *value);

extern StructOpErrorStatus ModifyAdpd400xLcfgStructureRaw(
    uint32_t field, int32_t val);

extern void RegisterMwPpgGetLCFGRegCB(
    StructOpErrorStatus (*pfn)(int32_t *, uint8_t *));

extern void RegisterMwPpgReadLCFGRegCB(
    StructOpErrorStatus (*pfn)(uint32_t, int32_t *));

extern void RegisterMwPpgModifyLCFGRegCB(
    StructOpErrorStatus (*pfn)(uint32_t, int32_t));

extern void SyncAppDataSend(uint32_t *p_data, uint32_t adpdtimestamp,
    int16_t *pAdxlData, uint32_t adxltimestamp);
extern void app_sync_timer_init(void);
extern uint16_t Adpd400xUtilGetRegFromMonotonicCurrent(uint8_t ncurrent);
#endif

#ifdef ENABLE_TEMPERATURE_APP
extern void temperatureAppData(uint32_t *pData);
#endif
extern void ADP5360_gpio_interrupt_enable();
extern void enable_ext_syncmode();
extern void disable_ext_syncmode();
/*---------------------- Private variables -----------------------------------*/

static M2M2_ADDR_ENUM_t gsStream[SLOT_NUM] = {
    M2M2_ADDR_SENSOR_ADPD_STREAM1,
    M2M2_ADDR_SENSOR_ADPD_STREAM2,
    M2M2_ADDR_SENSOR_ADPD_STREAM3,
    M2M2_ADDR_SENSOR_ADPD_STREAM4,
    M2M2_ADDR_SENSOR_ADPD_STREAM5,
    M2M2_ADDR_SENSOR_ADPD_STREAM6,
    M2M2_ADDR_SENSOR_ADPD_STREAM7,
    M2M2_ADDR_SENSOR_ADPD_STREAM8,
    M2M2_ADDR_SENSOR_ADPD_STREAM9,
    M2M2_ADDR_SENSOR_ADPD_STREAM10,
    M2M2_ADDR_SENSOR_ADPD_STREAM11,
    M2M2_ADDR_SENSOR_ADPD_STREAM12,
};

#ifndef ADPD_SEM_CORRUPTION_DEBUG
/* Create the stack for task */
static uint8_t
    sensor_adpd4000_task_stack[APP_OS_CFG_SENSOR_ADPD4000_TASK_STK_SIZE];
#else
/* Create the stack for task */
 uint8_t
    sensor_adpd4000_task_stack[2048];
#endif

/* Create handler for task */
static ADI_OSAL_THREAD_HANDLE sensor_adpd4000_task_handler;

/* Create task attributes variable */
static ADI_OSAL_STATIC_THREAD_ATTR sensor_adpd4000_task_attributes;

/* Create TCB for task */
static StaticTask_t adpd4000TaskTcb;

/* Create semaphores */
ADI_OSAL_SEM_HANDLE adpd4000_task_evt_sem;

#ifdef ADPD_SEM_CORRUPTION_DEBUG
int gAdpdPendFlag = 0;
uint8_t *pAdpdSemPtr = NULL;
#endif

ADI_OSAL_SEM_HANDLE adpd4000_task_floatmode_sem, adpd4000_task_setDarkValue_sem,
    adpd4000_task_getCtr_sem;

/* Create Queue Handler for task */
static ADI_OSAL_QUEUE_HANDLE adpd4000_task_msg_queue = NULL;

const char GIT_ADPD4000_VERSION[] = "TEST ADPD4000_VERSION STRING";
const uint8_t GIT_ADPD4000_VERSION_LEN = sizeof(GIT_ADPD4000_VERSION);

static fifo_data_pattern sReadBufferPattern;
static m2m2_hdr_t *pOptionalPkt;
static m2m2_sensor_fifo_status_bytes_t _PreviousStatus;
static bool check_dcb_erase = false;
/*------------------------ Private Function Prototype -----------------------*/
static m2m2_hdr_t *adpd_app_reg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_do_clock_cal(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_load_cfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_slotmode(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_slot_active_mode(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_get_dcfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_decimation(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_get_version(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_do_general1_cmd(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_do_general2_cmd(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_do_general3_cmd(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_set_pause(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_get_com_mode(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_create_dcfg(m2m2_hdr_t *p_pkt);
#ifdef SLOT_SELECT
static m2m2_hdr_t *adpd_app_disable_slot(m2m2_hdr_t *p_pkt);
#endif
static m2m2_hdr_t *ecg4k_lcfg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *set_adpd4000_fs(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_agc_on_off_cntrl(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_agc_info(m2m2_hdr_t *p_pkt);
#ifdef ENABLE_SQI_APP
static m2m2_hdr_t *adpd_app_ext_adpd_datastream(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_app_set_ext_adpd_datastream_odr(m2m2_hdr_t *p_pkt);
#endif
#ifdef DCB
static m2m2_hdr_t *adpd_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adpd_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif
#ifdef ENABLE_PPG_APP
static m2m2_hdr_t *adpd_app_uc_hr_enable(m2m2_hdr_t *p_pkt);
#endif
static void adpd_data_ready_cb(void);
static uint8_t fetch_adpd_data(void);
static void sensor_adpd4000_task(void *pArgument);
static void reset_adpd_packetization(void);
static bool _OptionalByteArrange(uint8_t *, uint16_t, uint32_t, m2m2_hdr_t *);

#ifdef OS_TIMER
static OS_TMR gsPollFIFO_Timer;
#endif
static bool bIsStatusStreamEnabled = false;
static uint16_t nStatusRegValue = 0;

/* For NK UC - ADPD@500Hz, ADXL@50Hz, EDA@8Hz, Temp@1Hz it is required to keep
 * ADPD task at higher priority */
/* Flag which holds the status of ADPD task priority change */
static volatile uint8_t gbAdpdHighPrio = 0;

