ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
/* ADPD task priority level to be kept when ADPD runs at 500Hz */
#define ADPD_500Hz_TASK_PRIO 7

/*!
 *
 * @brief Array for routing m2m2 pkt to different function in ADPD4k task
 */
app_routing_table_entry_t adpd4000_app_routing_table[] = {
    {M2M2_APP_COMMON_CMD_STREAM_START_REQ, adpd_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, adpd_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, adpd_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, adpd_app_stream_config},
    {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, adpd_app_status},
    {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, ecg4k_lcfg_access},
    {M2M2_APP_COMMON_CMD_READ_LCFG_REQ, ecg4k_lcfg_access},
    {M2M2_SENSOR_ADPD_COMMAND_SET_FS_REQ, set_adpd4000_fs},
    {M2M2_SENSOR_ADPD_COMMAND_LOAD_CFG_REQ, adpd_app_load_cfg},
    {M2M2_SENSOR_ADPD_COMMAND_CLOCK_CAL_REQ, adpd_app_do_clock_cal},
    {M2M2_SENSOR_ADPD_COMMAND_SET_SLOT_REQ, adpd_app_slotmode},
    {M2M2_SENSOR_ADPD_COMMAND_GET_SLOT_REQ, adpd_app_slotmode},
    {M2M2_SENSOR_ADPD_COMMAND_SET_SLOT_ACTIVE_REQ, adpd_app_slot_active_mode},
    {M2M2_SENSOR_ADPD_COMMAND_GET_SLOT_ACTIVE_REQ, adpd_app_slot_active_mode},
    {M2M2_SENSOR_ADPD_COMMAND_SET_PAUSE_REQ, adpd_app_set_pause},
    {M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ, adpd_app_reg_access},
    {M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ, adpd_app_reg_access},
    {M2M2_SENSOR_COMMON_CMD_GET_DCFG_REQ, adpd_app_get_dcfg},
    {M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ, adpd_app_decimation},
    {M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ, adpd_app_decimation},
    {M2M2_APP_COMMON_CMD_GET_VERSION_REQ, adpd_app_get_version},
    {M2M2_SENSOR_ADPD_COMMUNICATION_MODE_REQ, adpd_app_get_com_mode},
    {M2M2_SENSOR_ADPD_COMMAND_DO_TEST1_REQ, adpd_app_do_general1_cmd},
    {M2M2_SENSOR_ADPD_COMMAND_DO_TEST2_REQ, adpd_app_do_general2_cmd},
    {M2M2_SENSOR_ADPD_COMMAND_DO_TEST3_REQ, adpd_app_do_general3_cmd},
    {M2M2_SENSOR_ADPD_COMMAND_CREATE_DCFG_REQ, adpd_app_create_dcfg},
#ifdef ENABLE_SQI_APP
    {M2M2_SENSOR_ADPD_COMMAND_EXT_ADPD_DATA_STREAM, adpd_app_ext_adpd_datastream},
    {M2M2_SENSOR_ADPD_COMMAND_SET_EXT_DATA_STREAM_ODR_REQ, adpd_app_set_ext_adpd_datastream_odr},
#endif
#ifdef SLOT_SELECT
    {M2M2_SENSOR_ADPD_COMMAND_DISABLE_SLOTS_REQ, adpd_app_disable_slot},
#endif
    {M2M2_SENSOR_ADPD_COMMAND_AGC_ON_OFF_REQ, adpd_app_agc_on_off_cntrl},
    {M2M2_SENSOR_ADPD_COMMAND_AGC_INFO_REQ, adpd_app_agc_info},
#ifdef DCB
    {M2M2_DCB_COMMAND_READ_CONFIG_REQ, adpd_dcb_command_read_config},
    {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, adpd_dcb_command_write_config},
    {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, adpd_dcb_command_delete_config},
#endif
#ifdef ENABLE_PPG_APP
    {M2M2_SENSOR_ADPD_COMMAND_UC_HR_ENAB_REQ, adpd_app_uc_hr_enable},
#endif
};

#ifdef USER0_CONFIG_APP
#include "user0_config_app_task.h"
#include "app_timer.h"
#include "low_touch_task.h"
APP_TIMER_DEF(m_adpd_timer_id);     /**< Handler for repeated timer for ADPD. */
static void adpd_timer_start(void);
static void adpd_timer_stop(void);
static void adpd_timeout_handler(void * p_context);
void start_adpd_app_timer();
static user0_config_app_timing_params_t adpd_app_timings = {0};

/**@brief Function for the Timer initialization.
*
* @details Initializes the timer module. This creates and starts application timers.
*
* @param[in]  None
*
* @return     None
*/
static void adpd_timer_init(void)
{
    ret_code_t err_code;

    /*! Create timers */
    err_code =  app_timer_create(&m_adpd_timer_id, APP_TIMER_MODE_REPEATED, adpd_timeout_handler);

    APP_ERROR_CHECK(err_code);
}

/**@brief   Function for starting application timers.
* @details Timers are run after the scheduler has started.
*
* @param[in]  None
*
* @return     None
*/
static void adpd_timer_start(void)
{
    /*! Start repeated timer */
    ret_code_t err_code = app_timer_start(m_adpd_timer_id, APP_TIMER_TICKS(TIMER_ONE_SEC_INTERVAL), NULL);
    APP_ERROR_CHECK(err_code);

    adpd_app_timings.check_timer_started = true;
}

/**@brief   Function for stopping the application timers.
*
* @param[in]  None
*
* @return     None
*/
static void adpd_timer_stop(void)
{
    /*! Stop the repeated timer */
    ret_code_t err_code = app_timer_stop(m_adpd_timer_id);
    APP_ERROR_CHECK(err_code);

    adpd_app_timings.check_timer_started = false;
}

/**@brief   Callback Function for application timer events
*
* @param[in]  p_context: pointer to the callback function arguments
*
* @return     None
*/
static void adpd_timeout_handler(void * p_context)
{
    if(adpd_app_timings.delayed_start && adpd_app_timings.start_time>0)
    {
      adpd_app_timings.start_time_count++; /*! Increment counter every sec., till it is equal to start_time Value in seconds. */
      if(adpd_app_timings.start_time_count == adpd_app_timings.start_time)
      {
        /* if Temperarture stream was previously running,
        then set the correct LED current because it was set to 0
        during temperature stream start */
#ifdef ENABLE_TEMPERATURE_APP
        if ((gsTemperatureStarts > 0)) {
#ifndef SLOT_SELECT
          for (uint8_t i = 0; i < SLOT_NUM; i++) {
            g_adpd_reg_base = i * ADPD400x_SLOT_BASE_ADDR_DIFF;
            Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_adpd_reg_base,
                led_reg.reg_val[i].reg_pow12);
            Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_adpd_reg_base,
                led_reg.reg_val[i].reg_pow34);
          }
#endif
        }
#endif
        //delayed start time expired-turn ON ADPD
        if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE))
        {
        }
        adpd_app_timings.delayed_start = false;
        adpd_app_timings.start_time_count = 0;
        adpd_app_timings.app_mode_on = true;
      }
      return;
    }

    if(adpd_app_timings.app_mode_on && adpd_app_timings.on_time>0)
    {
        adpd_app_timings.on_time_count++; /*! Increment counter every sec. incase of ADPD ON, till it is equal to Ton Value in seconds. */
        if(adpd_app_timings.on_time_count == adpd_app_timings.on_time)
        {
          //on timer expired - turn off ADPD
          if (g_state.num_starts >= 1) {
              if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE)) {
              }
          }
          adpd_app_timings.app_mode_on = false;
          adpd_app_timings.on_time_count = 0;
        }
    }
    else if(!adpd_app_timings.app_mode_on && adpd_app_timings.off_time>0)
    {
      adpd_app_timings.off_time_count++; /*! Increment counter every sec. incase of ADPD OFF, till it is equal to Toff Value in seconds.*/
      if(adpd_app_timings.off_time_count == adpd_app_timings.off_time)
        {
           //off timer expired - turn on ADPD
           if (g_state.num_starts >= 1) {
               if (ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE))
               {
               }
           }
           adpd_app_timings.app_mode_on = true;
           adpd_app_timings.off_time_count = 0;
        }
    }
}

/**@brief   Function to start ADPD app timer
* @details  This is used in either interval based/intermittent LT mode3
*
* @param[in]  None
*
* @return     None
*/
void start_adpd_app_timer()
{
  if(adpd_app_timings.on_time > 0)
  {
    adpd_timer_start();
  }
}
#endif//USER0_CONFIG_APP

/*!
 ****************************************************************************
 * @brief ADPD4k task initialization
 *
 * @param[in]     None
 *
 * @return        None
 *****************************************************************************/
void sensor_adpd4000_task_init(void) {
  /* Initialize app state */
  g_state.num_starts = 0;
  /* Default behaviour is to send every packet */
  g_state.decimation_factor = 1;

  for (uint8_t i = 0; i < SLOT_NUM; i++) {
    g_state.num_subs[i] = 0;
    g_state.data_pkt_seq_num[i][CH1] = 0;
    g_state.data_pkt_seq_num[i][CH2] = 0;
  }

  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  sensor_adpd4000_task_attributes.pThreadFunc = sensor_adpd4000_task;
  sensor_adpd4000_task_attributes.nPriority =
      APP_OS_CFG_SENSOR_ADPD4000_TASK_PRIO;
  sensor_adpd4000_task_attributes.pStackBase = &sensor_adpd4000_task_stack[0];
  sensor_adpd4000_task_attributes.nStackSize =
#ifndef ADPD_SEM_CORRUPTION_DEBUG
      APP_OS_CFG_SENSOR_ADPD4000_TASK_STK_SIZE;
#else
      2048;
#endif
  sensor_adpd4000_task_attributes.pTaskAttrParam = NULL;
  sensor_adpd4000_task_attributes.szThreadName = "ADPD4000 Sensor";
  sensor_adpd4000_task_attributes.pThreadTcb = &adpd4000TaskTcb;
  eOsStatus = adi_osal_MsgQueueCreate(&adpd4000_task_msg_queue, NULL, 25);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(
        APP_OS_CFG_ADPD4000_TASK_INDEX, adpd4000_task_msg_queue);
  }
  eOsStatus = adi_osal_ThreadCreateStatic(
      &sensor_adpd4000_task_handler, &sensor_adpd4000_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  adi_osal_SemCreate(&adpd4000_task_evt_sem, 0);
  adi_osal_SemCreate(&adpd4000_task_setDarkValue_sem, 0);
  adi_osal_SemCreate(&adpd4000_task_getCtr_sem, 0);
  adi_osal_SemCreate(&adpd4000_task_floatmode_sem, 0);
#ifdef ADPD_SEM_CORRUPTION_DEBUG
  pAdpdSemPtr = (uint8_t *)adpd4000_task_evt_sem;
#endif
  post_office_add_mailbox(M2M2_ADDR_SYS_PM, M2M2_ADDR_SYS_DBG_STREAM);
}

/*!
 ****************************************************************************
 * @brief Send msg packet to ADPD4k application from the post office
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              None
 *****************************************************************************/
void send_message_adpd4000_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(adpd4000_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(adpd4000_task_evt_sem);
}

/*!
  ****************************************************************************
* @brief - Configuring ADPD4k during bootup
*        - Interface for sending ADPD4k data to other apps
           and packetizing ADPD4k stream pkt
*
* @param[in]           pArgument not used
*
* @return              None
*****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
uint16_t stop_resp_sent_from_adpd_task=0;
uint16_t stop_req_adpd_task=0;
uint8_t command_type=0;
#endif
static void sensor_adpd4000_task(void *pArgument) {
  ADI_OSAL_STATUS err;
  uint16_t nDevId = 0;
  uint8_t i;

  for (i = 0; i < SLOT_NUM; i++) {
    post_office_add_mailbox(M2M2_ADDR_SENSOR_ADPD4000,
        (M2M2_ADDR_ENUM_t)(M2M2_ADDR_SENSOR_ADPD_STREAM1 + i));
  }

