ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
  ret_code_t err_code = sd_nvic_SetPriority(GPIOTE_IRQn, APP_IRQ_PRIORITY_LOW);
  APP_ERROR_CHECK(err_code);
  GPIO_IRQ_ADPD_Enable();

  /* Putting ADP5360 interrupt enable in task context.
     Since ADP5360 doesnt have a separate task, its put in adpd4000 task */
  ADP5360_gpio_interrupt_enable();

  /* Init the adpd buffer with a sample size of 4 bytes.
     This size will be automatically updated based on the slot mode. */
  adpd4000_buff_init(8);

  if (Adpd400xDrvOpenDriver() != 0) {
    Debug_Handler();
  }
  Adpd400xDrvDataReadyCallback(adpd_data_ready_cb);
#ifdef ENABLE_PPG_APP
  Adpd400xSetSlot_RegCB(AdpdClSelectSlot);
  Adpd400xSetMode_RegCB(AdpdClSetOperationMode);
  PpgAdpd400xLibGetSampleRate_RegCB(GetAdpdClOutputRate);
  PpgAdpd400xLibSetSampleRate_RegCB(SetAdpdClOutputRate);
  RegisterPpgCB(Adpd400xDrvSetOperationMode);
  RegisterMwPpgGetLCFGRegCB(GetAdpd400xLcfgStructure);
  RegisterMwPpgReadLCFGRegCB(ReadAdpd400xLcfgStructureRaw);
  RegisterMwPpgModifyLCFGRegCB(ModifyAdpd400xLcfgStructureRaw);
#endif

  /*Wait for FDS init to complete*/
  adi_osal_SemPend(adpd4000_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

  Adpd400xDrvRegRead(ADPD400x_REG_CHIP_ID, &nDevId);
  /* Check if its DVT2 chip */
  if (nDevId != 0xc0) {
    NRF_LOG_INFO("** Working with board having ADPD4100 **");
    dvt2 = 1;
  } else {
    NRF_LOG_INFO("** Working with board having ADPD4000 **");
    dvt2 = 0;
  }
  if (load_adpd4000_cfg(M2M2_SENSOR_ADPD4000_DEVICE_4000_G) !=
      ADPD4000_DCFG_STATUS_OK) {
    Debug_Handler();
  }
  Adpd400xDrvSetParameter(ADPD400x_WATERMARKING, 0, 4);
  reset_agc_flags();/**reset AGC flags **/

#ifdef ENABLE_PPG_APP
  //Initilaze the app_timer for sync buffering for UC HR
  app_sync_timer_init();
#endif

#ifdef USER0_CONFIG_APP
  adpd_timer_init();
#endif

  while (1) {
    m2m2_hdr_t *p_in_pkt = NULL;
    m2m2_hdr_t *p_out_pkt = NULL;
#ifdef ADPD_SEM_CORRUPTION_DEBUG
    gAdpdPendFlag = 1;
    if(pAdpdSemPtr != (uint8_t *)adpd4000_task_evt_sem)
	{
      gAdpdPendFlag = 0xFF;
      p_in_pkt =
          post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_ADPD4000_TASK_INDEX);
      if(p_in_pkt == NULL)
          fetch_adpd_data();
    }
    else
    {
    	adi_osal_SemPend(adpd4000_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    	gAdpdPendFlag = 0;
	 	p_in_pkt =
        post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_ADPD4000_TASK_INDEX);
    }
#else
    adi_osal_SemPend(adpd4000_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
	p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_ADPD4000_TASK_INDEX);
#endif

    if (p_in_pkt == NULL) {
      /* No m2m2 messages to process, so fetch some data from the device. */
      /*_nStatus = */ fetch_adpd_data();
    } else {
      /* We got an m2m2 message from the queue, process it. */
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);

#ifdef ADPD_SEM_CORRUPTION_DEBUG
      if(p_in_cmd->command == M2M2_SENSOR_ADPD_COMMAND_LOAD_CFG_REQ){
        command_type=1;
      }
      else if(p_in_cmd->command == M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ){
        command_type=2;
      }
      else if(p_in_cmd->command == M2M2_SENSOR_ADPD_COMMAND_CLOCK_CAL_REQ){
        command_type=3;
      }
      else if(p_in_cmd->command == M2M2_SENSOR_ADPD_COMMAND_CLOCK_CAL_REQ){
        command_type=4;
      }
       else if(p_in_cmd->command == M2M2_SENSOR_ADPD_COMMAND_AGC_ON_OFF_REQ){
        command_type=5;
      }
      else if(p_in_cmd->command == M2M2_APP_COMMON_CMD_STREAM_START_REQ){
        command_type=5;
      }
      else if(p_in_cmd->command == M2M2_APP_COMMON_CMD_STREAM_STOP_REQ){
        stop_req_adpd_task += 1;
        command_type=7;
        NRF_LOG_INFO("command type = %d",command_type);
      }
#endif
      /* Look up the appropriate function to call in the function table */
      for (int i = 0; i < ADPD_APP_ROUTING_TBL_SZ; i++) {
        if (adpd4000_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = adpd4000_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
#ifdef ADPD_SEM_CORRUPTION_DEBUG
        if(p_in_cmd->command == M2M2_APP_COMMON_CMD_STREAM_STOP_REQ){
          stop_resp_sent_from_adpd_task +=1;
        }
#endif
      }
    }
  }
}

/*!
 ****************************************************************************
 * @brief Reset ADPD4k Packetization
 *
 * @param[in]      None
 *
 * @return         None
 *****************************************************************************/
static void reset_adpd_packetization(void) {
  uint8_t i;

  for (i = 0; i < SLOT_NUM; i++) {
    g_state.sl_pktizer1[i].packet_max_nsamples = MAX_PAYLOAD_BYTE;
    g_state.sl_pktizer1[i].sample_sz = 0;
    g_state.sl_pktizer1[i].packet_nsamples = 0;
    g_state.sl_pktizer2[i].packet_max_nsamples = MAX_PAYLOAD_BYTE;
    g_state.sl_pktizer2[i].sample_sz = 0;
    g_state.sl_pktizer2[i].packet_nsamples = 0;
    g_state.sl_pktizer1[i].decimation_nsamples = 0;
    g_state.sl_pktizer2[i].decimation_nsamples = 0;
  }
}

/*!
 ****************************************************************************
 * @brief Read ADPD4k data from buffer,
 *        -Send it to other apps (PPG, TEMP, SQI), if active.
 *        -packetize them and send it to postoffice, if ADPD4k app is started.
 *
 * @param[in]     None
 *
 * @return        0- Success, 1- Error
 *****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
 m2m2_hdr_t    *sempahore_add_channel1=NULL;
 m2m2_hdr_t    *sempahore_add_channel2=NULL;
 uint16_t dataPtr =0,eachSlotSize =0;
 uint32_t gn_sample_size_cp=0;
#endif

static uint8_t fetch_adpd_data(void) {
  ADI_OSAL_STATUS err;
  uint32_t timestamp = 0;
  uint16_t nSampleSize = 0;
  uint32_t ppgData[NUM_CH_PER_SLOT] = {0}, tmpPPGData[NUM_CH_PER_SLOT] = {0};
  uint32_t ch1ch2data[NUM_CH_PER_SLOT] = {0};
  uint16_t nWaterMark=1, nMaximumFifoTh = 0;
#ifdef ENABLE_PPG_APP
  uint8_t nModifyChannelData = 0;
  uint8_t nShiftFactor = 0;
  uint8_t nSkipCh2Packetization = 0;
  uint32_t nTargetCh,n_recal_time_in_min;
#endif
#ifdef ADPD_SEM_CORRUPTION_DEBUG
  uint8_t i, tmp[256];//, dataPtr;
  /* Maximum D=4,S=4 and 2 Channels enabled for all slots
     (need to set it for maximum data==>(4+4)*2*12) */
  uint16_t slot_sz[SLOT_NUM], impulse_Slot_Size;
#else
  uint8_t i, tmp[256], dataPtr;
  /* Maximum D=4,S=4 and 2 Channels enabled for all slots
     (need to set it for maximum data==>(4+4)*2*12) */
  uint16_t slot_sz[SLOT_NUM], eachSlotSize, impulse_Slot_Size;
#endif
  uint32_t len = sizeof(tmp);
  uint16_t highest_slot, ch_num[SLOT_NUM];
  CIRC_BUFF_STATUS_t status;
  static m2m2_sensor_adpd4000_data_stream_t adpd_ch1_pkt[SLOT_NUM] = {'\0'},
                                            adpd_ch2_pkt[SLOT_NUM] = {'\0'};

  if (gsOneTimeValueWhenReadAdpdData == 0) {
    gsOneTimeValueWhenReadAdpdData = 1;
    if(gbAdpdSamplingRateChanged)
    {
      gbAdpdSamplingRateChanged = 0;
      /* reset the counter for temp only if sampling rate is changed */
      gsTempSampleCount = 0;
    }
    Adpd400xDrvRegRead(ADPD400x_REG_FIFO_STATUS_BYTES, &nStatusRegValue);
    // Handle ADPD at 500Hz by increasing ADPD task priority
    if ((gAdpdSlotMaxODR >= 500) && (gbAdpdHighPrio == 0)) {
      adi_osal_ThreadSetPrio(NULL, ADPD_500Hz_TASK_PRIO);
      gbAdpdHighPrio = 1;
    }
  }

  if (nStatusRegValue != 0) {
    /* Clear the level interrupt status register */
    Adpd400xDrvRegWrite(ADPD400x_REG_INT_STATUS_LEV0, 0xFFFF);
    Adpd400xDrvRegWrite(ADPD400x_REG_INT_STATUS_LEV1, 0xFFFF);
  }

