ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
  memset(&tmp[0], 0x00, sizeof(tmp));
  /* read data from FIFO to buffer */
  if (adpd4000_read_data_to_buffer(&slot_sz[0], &highest_slot, &ch_num[0]) !=
      0) {
    /* Get all slot samples */

    status = adpd4000_buff_get(&tmp[0], &timestamp, &len);
  } else {
    /* Something went wrong with data interrupt */
    return 1;
  }

  while (status == CIRC_BUFF_STATUS_OK) {
    dataPtr = 0;
    /* Get the FIFO pattern for the given sequecne number  */
    get_current_datapattern(
        &nReadSequence, gsSlot, gnLcmValue, highest_slot, &sReadBufferPattern);

    for (i = 0; i <= highest_slot; i++) {
#ifdef ENABLE_PPG_APP
      nModifyChannelData = 0;
      nShiftFactor = 0;
      nSkipCh2Packetization = 0;
#endif
      /* not subscriber or inactive slot */
      if ((slot_sz[i] & 0x0100) == 0) { /* not Impulse mode */
        /* eachSlotSize = (slot_sz[i] & 0xF) + ((slot_sz[i] & 0xF0) >> 4); */
        /* Get the Lit, Dart & Signal size from 16-bit array element
         *---------*---------*--------*--------*
         * Lit     * Impulse * Dark   * Signal *
         *---------*---------*--------*--------*
         * [15:12] * [11:8]  * [7:4]  * [3:0]  *
         *---------*---------*--------*--------*
         */
        eachSlotSize = ((slot_sz[i] >> 12) & 0xF) + ((slot_sz[i] >> 4) & 0xF) +
                       (slot_sz[i] & 0xF);
      } else {
        eachSlotSize = 2;
        impulse_Slot_Size = slot_sz[i] & 0xff;
      }

      if (sReadBufferPattern.slot_info[i] == '0') {
        /* if the slot is skipped, increment the dataPtr
           with skipped slot size and iterate through next slot */
        dataPtr += eachSlotSize;
        continue;
      }

      if (gsSlot[i].activeSlot == 0) { /* Inactive slot */
        continue;
      }

#ifdef ENABLE_TEMPERATURE_APP
#ifdef EVTBOARD
      /* Check the slot is in Temperature mode */
      if (gnTemperature_Slot != 0) {
        if (gnTemperature_Slot == (0x01 << i)) {
          if (++gsTempSampleCount == gsSlot[i].odr) {
            gsTempSampleCount = 0;
            /* Get Thermistor value */
            memcpy(&tmpPPGData[0], &tmp[dataPtr], eachSlotSize);
            ppgData[0] = *(uint32_t *)tmpPPGData;
            /* Get Calibration resistor value */
            memcpy(&tmpPPGData[0], &tmp[dataPtr + eachSlotSize], eachSlotSize);
            ppgData[1] = *(uint32_t *)tmpPPGData;
            temperatureAppData(ppgData);
          }
        }
      }
#endif
#endif

#ifdef ENABLE_SQI_APP
      /* Check if sqi event is started */
      if (gnSQI_Slot != 0) {
        if (gnSQI_Slot == (0x01 << i)) {
          if (sqi_event == 1 && ((g_state.num_subs[i] > 0)
#ifdef ENABLE_PPG_APP
          || (gnSQI_Slot == Ppg_Slot)) )
#else
          ))
#endif
          {
            /* Send only Ch1 data */
            memcpy(&tmpPPGData[CH1], &tmp[dataPtr], eachSlotSize);
            ppgData[CH1] = *(uint32_t *)tmpPPGData;
            send_sqi_app_data(&ppgData[CH1], timestamp);
          }
        }
      }
#endif

#ifdef ENABLE_PPG_APP
      /* Check the slot is in PPG mode and agc calibration is done */
      if (Ppg_Slot != 0 && !gRun_agc) {
        if (Ppg_Slot == (0x01 << i)) {
          if(!gPpg_agc_en && !gPpg_agc_done){
             update_ppg_default_current_gain(i);// update lcfg current and gain if static agc not enabled for ppg
             gPpg_agc_done = 1;
           }
#ifdef SLOT_SELECT
          if (++gsSampleCount1 == gsSlot[i].odr / gAdpd400x_lcfg->hrmInputRate) {
            gsSampleCount1 = 0;
#endif
            memcpy(&tmpPPGData[CH1], &tmp[dataPtr], eachSlotSize);
            ppgData[CH1] = *(uint32_t *)tmpPPGData;
            ppgData[CH2] = 0;
            /* check if CH2 enabled */
            if ((ch_num[i] == 3) && ((gAdpd400xLibCfg.targetChs & BITM_TARGET_CH) != TARGET_CH3)) {
              /* Get CH2 data */
              memcpy(&tmpPPGData[CH2], &tmp[dataPtr + eachSlotSize], eachSlotSize);
              ppgData[CH2] = *(uint32_t *)(tmpPPGData + 1);
            }
            SyncAppDataSend(ppgData, timestamp, 0, 0);
#ifdef SLOT_SELECT
           }
#endif
         }//if (Ppg_Slot == (0x01 << i))
       }//if (Ppg_Slot != 0 && !gRun_agc)

     /* Check if ppg app is not running & if its slot F data
        to calculate HR */
    if (gn_uc_hr_enable && Ppg_Slot == 0 && i==(gn_uc_hr_slot-1) && !gRun_agc) {
      MwPPG_ReadLCFG(2, &nTargetCh);
      if(((nTargetCh & BITM_TARGET_CH) == TARGET_CH4) || ((nTargetCh & BITM_TARGET_CH) == TARGET_CH3)
       || ((nTargetCh & BITM_TARGET_CH) == TARGET_CH1)) {

        if((nTargetCh & BITM_TARGET_CH) != TARGET_CH1) {// sum and shift factor option not available for TARGET_CH1
          nModifyChannelData = 1;
          nShiftFactor = (nTargetCh & BITM_CHANNEL_SHIFT_FACTOR) >> 4;
        }
        if((nTargetCh & BITM_DISABLE_CH2_PACKETIZATION) != 0) {// skip ch2 packet option available for TARGET_CH1/CH3/CH4
          nSkipCh2Packetization = 1;
        }
      }
      MwPPG_ReadLCFG(12, &n_recal_time_in_min);/*! To read staticAgcRecalTime */
      if((n_recal_time_in_min != 0) && (++gsResetStaticAgcSampleCnt >= (gsSlot[i].odr * n_recal_time_in_min * SECONDS_PER_MIN)))
      {
        gsResetStaticAgcSampleCnt = 0;
        /*Put the device into IDLE mode*/
        Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE);

        /*Reset flags related green LED*/
        gPpg_agc_done = 0;

        /*Set flags condition to trigger agc recalibration */
        gPpg_agc_en = 1;
        gn_led_slot_g = G_LED_AGC_SLOTS;
        gn_agc_active_slots = gn_led_slot_g;
        gRun_agc = true;

        /*Put the device back to sample mode*/
        Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE);
      }

      if(!gPpg_agc_en && !gPpg_agc_done){
        update_ppg_default_current_gain(i);// update lcfg current and gain if static agc not enabled for ppg
        gPpg_agc_done = 1;
      }
      if (++gnHRAdpdSampleCount == gsSlot[i].odr / gAdpd400xLibCfg.hrmInputRate) {
        gnHRAdpdSampleCount = 0;
        /* send CH1 data */
        memcpy(&tmpPPGData[CH1], &tmp[dataPtr], eachSlotSize);
        ppgData[CH1] = *(uint32_t *)tmpPPGData;
        ppgData[CH2] = 0;
        /* check if CH2 enabled */
        if ((ch_num[i] == 3) && ((gAdpd400xLibCfg.targetChs & BITM_TARGET_CH) != TARGET_CH3)) {
        /* Get CH2 data */
        memcpy(&tmpPPGData[CH2], &tmp[dataPtr + eachSlotSize], eachSlotSize);
        ppgData[CH2] = *(uint32_t *)(tmpPPGData + 1);
        }
        /* send data to ppg task */
        SyncAppDataSend(ppgData, timestamp, 0, 0);
       }
     }
#endif //ENABLE_PPG_APP

