ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
     if(gRun_agc){
       if (gn_agc_active_slots != 0) {
         if (gn_agc_active_slots & (0x01 << i)) {
            int8_t slotnum = i;
            if (gsAgcFlag == 0) {
              agc_init();
              gsAgcFlag = 1;
            }
            if (gsAgcSampleCnt[slotnum] < SKIP_SAMPLES) {
              gsAgcSampleCnt[slotnum]++;
              /* waiting for agc buffer to fill */
            } else if (gsAgcSampleCnt[slotnum] < SKIP_SAMPLES + SAMPLE_AVG_NUM) {
              /* Get CH1 data */
              memcpy(&tmpPPGData[CH1], &tmp[dataPtr], eachSlotSize);
              ppgData[CH1] = *(uint32_t *)tmpPPGData;
              agc_data[slotnum].ch1[gsAgcSampleCnt[slotnum] - SKIP_SAMPLES] = ppgData[CH1];
              /* check if CH2 enabled */
#ifdef ENABLE_PPG_APP
              /* if this slot is for green LED and UC HR enabled or if it is a PPG slot */
              if(((slotnum == (gn_uc_hr_slot - 1)) && gn_uc_hr_enable) || (Ppg_Slot == (1 << slotnum))) {
                ppgData[CH2] = 0;
                if (ch_num[i] == 3 && ((gAdpd400xLibCfg.targetChs & BITM_TARGET_CH) != TARGET_CH3)){
                  /* Get CH2 data */
                  memcpy(&tmpPPGData[CH2], &tmp[dataPtr + eachSlotSize], eachSlotSize);
                  ppgData[CH2] = *(uint32_t *)(tmpPPGData + 1);
                }
                agc_data[slotnum].ch2[gsAgcSampleCnt[slotnum] - SKIP_SAMPLES] = ppgData[CH2];
              }else{
#endif
                  ppgData[CH2] = 0;
                  if (ch_num[i] == 3) {
                  /* Get CH2 data */
                  memcpy(&tmpPPGData[CH2], &tmp[dataPtr + eachSlotSize], eachSlotSize);
                  ppgData[CH2] = *(uint32_t *)(tmpPPGData + 1);
                }
                agc_data[slotnum].ch2[gsAgcSampleCnt[slotnum] - SKIP_SAMPLES] = ppgData[CH2];
#ifdef ENABLE_PPG_APP
              }
#endif
              gsAgcSampleCnt[slotnum]++;
            } else if (gsAgcSampleCnt[slotnum] >=  SKIP_SAMPLES + SAMPLE_AVG_NUM) {
                agc_data_process();// do agc process for all the active slots
                for(uint8_t slot = 0; slot <= highest_slot ; slot++){
                  if (gn_agc_active_slots & (0x01 << slot)){
                  gsAgcSampleCnt[slot] = 0;
                  }
                }
#ifdef ENABLE_PPG_APP
                if(gPpg_agc_en)//if(gn_agc_active_slots & Ppg_slot)
                {
                  /* This variabe get reset on AGC un-subscribe in ppg application task */
                  if(!gnFirstAGCcal){
                    gnFirstAGCcal = 1;
                    Adpd400xLibUpdateAGCStateInfo(ADPD400xLIB_AGCLOG_STATIC_AGC_FIRST_CAL);//update agc stream info in library
                  }else{
                    Adpd400xLibUpdateAGCStateInfo(ADPD400xLIB_AGCLOG_STATIC_AGC_RECAL);//update agc stream info in library
                  }
                  gPpg_agc_done = 1;
                }
#endif
                agc_deinit();
                gsAgcFlag = 0;
                gRun_agc = false;
            }
         }//if (gn_agc_active_slots & (0x01 << i))
      }//if (gn_agc_active_slots != 0)
    }//gRun_agc

      if (eachSlotSize == 0) {
        /* update dataptr in tmp buffer, ptr to next slot */
        dataPtr += eachSlotSize;
        /* Check the channel 2 status,
           if channel 2 enabled then do update dataptr */
        if (ch_num[i] == 3) {
          /* update dataptr in tmp buffer, ptr to next slot */
          dataPtr += eachSlotSize;
        }
        continue;
      }

      /*
        considering no decimation,
        if odr < 25Hz, no. of samples = 1
        if odr < 75Hz, no. of samples = 2
        else, no. of samples = 6
      */
      g_state.sl_pktizer1[i].packet_nsamples++;
      if (g_state.sl_pktizer1[i].packet_nsamples == 1) { /* first sample */
        g_state.sl_pktizer1[i].packet_max_nsamples = 24 / eachSlotSize;
        if (g_state.sl_pktizer1[i].packet_max_nsamples > 6) {
          g_state.sl_pktizer1[i].packet_max_nsamples = 6;
        }

        if (gsSlot[i].odr < 25) {
          g_state.sl_pktizer1[i].packet_max_nsamples = 1;
        } else if (gsSlot[i].odr < 75) {
          if (g_state.sl_pktizer1[i].packet_max_nsamples > 2)
            g_state.sl_pktizer1[i].packet_max_nsamples = 2;
        }

        if ((slot_sz[i] & 0x0100) == 0) {
          g_state.sl_pktizer1[i].payload_ptr = &(adpd_ch1_pkt[i].adpddata[0]);
        } else {
          g_state.sl_pktizer1[i].packet_max_nsamples =
              (256) / (eachSlotSize * impulse_Slot_Size);
          g_state.sl_pktizer1[i].payload_ptr = &(adpd_ch1_pkt[i].adpddata[0]);
        }
      }
      /* in future, data in circular buffer should have a byte to indicate the
         size, slot, channel etc. */
      if ((slot_sz[i] & 0x0100) == 0) {
#ifdef ENABLE_PPG_APP
        if (nModifyChannelData) {
            ch1ch2data[CH1] = *(uint32_t*)&tmp[dataPtr];
            ch1ch2data[CH2] = 0;
            if (ch_num[i] == 3) {
             ch1ch2data[CH2] = *(uint32_t*)&tmp[dataPtr + eachSlotSize];
            }
            if((nTargetCh & BITM_TARGET_CH) == TARGET_CH4){
              ch1ch2data[CH1] = (ch1ch2data[CH1] >> nShiftFactor) + (ch1ch2data[CH2] >> nShiftFactor); //shift,sum ch1-ch2 and store to ch1 packetizer
            }else{
              ch1ch2data[CH1] = (ch1ch2data[CH1] >> nShiftFactor);// shift only the ch1 as PD1+PD2 connected to ch1 and store to ch1 packetizer
            }
            memcpy(g_state.sl_pktizer1[i].payload_ptr, &ch1ch2data[CH1], eachSlotSize);
         }else{
#endif
            memcpy(g_state.sl_pktizer1[i].payload_ptr,  &tmp[dataPtr], eachSlotSize);
#ifdef ENABLE_PPG_APP
         }
#endif
        /* update adpddata ptr */
        g_state.sl_pktizer1[i].payload_ptr += eachSlotSize;
        /* update dataptr in tmp buffer, ptr to next channel */
        dataPtr += eachSlotSize;
      } else {
        memcpy(g_state.sl_pktizer1[i].payload_ptr, &tmp[dataPtr],
            eachSlotSize * impulse_Slot_Size);
        /* update adpddata ptr */
        g_state.sl_pktizer1[i].payload_ptr +=
            (eachSlotSize * impulse_Slot_Size);
        /* update dataptr in tmp buffer, ptr to next channel */
        dataPtr += (eachSlotSize * impulse_Slot_Size);
      }

      g_state.sl_pktizer1[i].decimation_nsamples++;
      if ((g_state.sl_pktizer1[i].packet_nsamples >=
          g_state.sl_pktizer1[i].packet_max_nsamples) && (!gAdpdPause)) {
        /* PO pkt creation and sending is put under critical region, to avoid
           task switching during this phase, hence avoid pkt corruption */
        if (g_state.sl_pktizer1[i].decimation_nsamples >= (g_state.decimation_factor*g_state.sl_pktizer1[i].packet_max_nsamples)) {
            g_state.sl_pktizer1[i].decimation_nsamples = 0;
            g_state.sl_pktizer1[i].packet_nsamples = 0;
          if(g_state.num_subs[i] > 0) {
            adi_osal_EnterCriticalRegion();
            if ((slot_sz[i] & 0x0100) == 0) {
              g_state.sl_pktizer1[i].p_pkt = post_office_create_msg(sizeof(m2m2_sensor_adpd4000_data_stream_t) + M2M2_HEADER_SZ);
            } else {
              g_state.sl_pktizer1[i].p_pkt = post_office_create_msg(sizeof(m2m2_sensor_adpd4000_impulse_stream_t) + M2M2_HEADER_SZ);
            }
            if (g_state.sl_pktizer1[i].p_pkt != NULL) {
    #ifdef ADPD_SEM_CORRUPTION_DEBUG
              sempahore_add_channel1 = g_state.sl_pktizer1[i].p_pkt;
    #endif
              PYLD_CST(g_state.sl_pktizer1[i].p_pkt,
                  m2m2_sensor_adpd4000_data_stream_t, ptr_payload1);
              g_state.sl_pktizer1[i].p_pkt->src = M2M2_ADDR_SENSOR_ADPD4000;
              g_state.sl_pktizer1[i].p_pkt->dest = gsStream[i];
              memcpy(&ptr_payload1->command, &adpd_ch1_pkt[i],
                  sizeof(m2m2_sensor_adpd4000_data_stream_t));
              ptr_payload1->command =
                  (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
              ptr_payload1->status =
                  (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
              ptr_payload1->sequence_num = g_state.data_pkt_seq_num[i][CH1]++;
              ptr_payload1->data_format = slot_sz[i];
              ptr_payload1->timestamp = timestamp;
              ptr_payload1->sample_num = g_state.sl_pktizer1[i].packet_max_nsamples;
              ptr_payload1->channel_num = 1;
    #ifdef DEBUG_PKT
              post_office_msg_cnt(g_state.sl_pktizer1[i].p_pkt);
    #endif
#ifdef USER0_CONFIG_APP
            if(adpd_app_timings.app_mode_on)
            {
#endif //USER0_CONFIG_APP
              post_office_send(g_state.sl_pktizer1[i].p_pkt, &err);
#ifdef USER0_CONFIG_APP
            }//if(adpd_app_timings.app_mode_on)
            else
              post_office_consume_msg(g_state.sl_pktizer1[i].p_pkt);
#endif //USER0_CONFIG_APP
            }
            adi_osal_ExitCriticalRegion();
          }//if (g_state.num_subs[i] > 0)
        g_state.sl_pktizer1[i].p_pkt = NULL;
        }//if (g_state.decimation_nsamples_ch1 >= (g_state.decimation_factor*g_state.sl_pktizer1[i].packet_max_nsamples))
      }
      // NRF_LOG_INFO("ADPD Time stamp=%d",timestamp);

      if (ch_num[i] != 3)
        continue;
//nSkipCh2Packetization will be 1 ,if ch2 packet has to be skipped for targetch 4 and 3 option in LCFG
#ifdef ENABLE_PPG_APP
        if(!nSkipCh2Packetization) {
#endif
        g_state.sl_pktizer2[i].packet_nsamples++;
        if (g_state.sl_pktizer2[i].packet_nsamples == 1) { /* first sample */
          g_state.sl_pktizer2[i].packet_max_nsamples =
              g_state.sl_pktizer1[i].packet_max_nsamples;

          g_state.sl_pktizer2[i].payload_ptr = &(adpd_ch2_pkt[i].adpddata[0]);
        }

        memcpy(g_state.sl_pktizer2[i].payload_ptr, &tmp[dataPtr], eachSlotSize);
        g_state.sl_pktizer2[i].payload_ptr += eachSlotSize;
        /* update dataptr in tmp buffer. Ptr to next slot */
        dataPtr += eachSlotSize;
        g_state.sl_pktizer2[i].decimation_nsamples++;
        if ((g_state.sl_pktizer2[i].packet_nsamples >=
            g_state.sl_pktizer2[i].packet_max_nsamples)&&(!gAdpdPause)) {
          if (g_state.sl_pktizer2[i].decimation_nsamples >= (g_state.decimation_factor*g_state.sl_pktizer2[i].packet_max_nsamples)) {
            g_state.sl_pktizer2[i].decimation_nsamples = 0;
            g_state.sl_pktizer2[i].packet_nsamples = 0;
            if(g_state.num_subs[i] > 0) {
              adi_osal_EnterCriticalRegion();
              g_state.sl_pktizer2[i].p_pkt = post_office_create_msg(sizeof(m2m2_sensor_adpd4000_data_stream_t) +M2M2_HEADER_SZ); // TODO: review the changes to :check if p_pkt is
                                   // not NULL before writing
                                 //  g_state.sl_pktizer2[i].p_pkt=NULL;
              if (g_state.sl_pktizer2[i].p_pkt != NULL) {
      #ifdef ADPD_SEM_CORRUPTION_DEBUG
                sempahore_add_channel2 = g_state.sl_pktizer2[i].p_pkt;
      #endif
                PYLD_CST(g_state.sl_pktizer2[i].p_pkt,m2m2_sensor_adpd4000_data_stream_t, ptr_payload2);
                g_state.sl_pktizer2[i].p_pkt->src = M2M2_ADDR_SENSOR_ADPD4000;
                g_state.sl_pktizer2[i].p_pkt->dest = gsStream[i];
                memcpy(&ptr_payload2->command, &adpd_ch2_pkt[i],
                    sizeof(m2m2_sensor_adpd4000_data_stream_t));
                ptr_payload2->command =(M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
                ptr_payload2->status =(M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
                ptr_payload2->sequence_num = g_state.data_pkt_seq_num[i][CH2]++;
                ptr_payload2->data_format = slot_sz[i];
                ptr_payload2->timestamp = timestamp;
                ptr_payload2->sample_num = g_state.sl_pktizer2[i].packet_max_nsamples;
                ptr_payload2->channel_num = 2;
      #ifdef DEBUG_PKT
                post_office_msg_cnt(g_state.sl_pktizer2[i].p_pkt);
      #endif
#ifdef USER0_CONFIG_APP
                if(adpd_app_timings.app_mode_on)
                {
#endif //USER0_CONFIG_APP
                  post_office_send(g_state.sl_pktizer2[i].p_pkt, &err);
#ifdef USER0_CONFIG_APP
                }//if(adpd_app_timings.app_mode_on)
                else
                  post_office_consume_msg(g_state.sl_pktizer2[i].p_pkt);
#endif //USER0_CONFIG_APP
              }
              adi_osal_ExitCriticalRegion();
            }//g_state.num_subs[i] > 0
          g_state.sl_pktizer2[i].p_pkt = NULL;
          }//if (g_state.decimation_nsamples_ch2 >= (g_state.decimation_factor*g_state.sl_pktizer2[i].packet_max_nsamples))
        }
//Enable this code, if ch2 packet has to be skipped for targetch 4 option in LCFG
#ifdef ENABLE_PPG_APP
        }//if(nSkipCh2Packetization)
#endif
    }

    if (sReadBufferPattern.slot_info[1] != '0') {
      /* stream the Optional bytes data */
      if (bIsStatusStreamEnabled && (nStatusRegValue != 0)) {
        pOptionalPkt = post_office_create_msg(
            sizeof(m2m2_sensor_fifo_status_bytes_t) + M2M2_HEADER_SZ);
        if (pOptionalPkt != NULL) {
          pOptionalPkt->src = M2M2_ADDR_SENSOR_ADPD4000;
          pOptionalPkt->dest = M2M2_ADDR_SENSOR_ADPD_OPTIONAL_BYTES_STREAM;
          if (_OptionalByteArrange(
                  &tmp[dataPtr], nStatusRegValue, timestamp, pOptionalPkt)) {
            post_office_send(pOptionalPkt, &err);
          } else {
            post_office_consume_msg(pOptionalPkt);
          }
          pOptionalPkt = NULL;
        }
      }
    }
    status = adpd4000_buff_get(&tmp[0], &timestamp, &len);
  }
  nInterruptSequence = nReadSequence;
  /* set FIFO threshold value for 4 sets */
  nSampleSize = get_samples_size(
      gnAdpdFifoWaterMark, gsSlot, &nInterruptSequence, gnLcmValue, highest_slot);
  if (nSampleSize != 0) {
    nSampleSize += nFifoStatusByte;
    nMaximumFifoTh = (!dvt2) ? 0xFF: 0x1FF;
    Adpd400xDrvRegWrite(ADPD400x_REG_FIFO_CTL, (nSampleSize - 1) & nMaximumFifoTh);
  }
  return 0;
}

/*!
 ****************************************************************************
 * @brief Get ADPD4k DCFG
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_get_dcfg(m2m2_hdr_t *p_pkt) {

    uint16_t dcfg_size;
    uint16_t i = 0, num_pkts = 0, dcfg_array_index = 0;
    uint32_t  dcfgdata[MAXADPD4000DCBSIZE*MAX_ADPD4000_DCB_PKTS];
    ADI_OSAL_STATUS  err;
    M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;

  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_dcfg_data_t, 0);

  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_dcfg_data_t, p_resp_payload);
    memset(dcfgdata, 0,sizeof(dcfgdata));
    memset(p_resp_payload->dcfgdata, 0, sizeof(p_resp_payload->dcfgdata));
    if (ADPD4000_DCFG_STATUS_OK == read_adpd4000_dcfg(&dcfgdata[0], &dcfg_size)) { // dcfg size will give number of registers
      status = M2M2_APP_COMMON_STATUS_OK;
      num_pkts = (dcfg_size / MAXADPD4000DCBSIZE) + ((dcfg_size % MAXADPD4000DCBSIZE) ? 1 : 0 );
      dcfg_array_index = 0;
      for(uint16_t p = 0; p < num_pkts; p++) {
         p_resp_payload->size = \
              (p != num_pkts-1) ? MAXADPD4000DCBSIZE : (dcfg_size % MAXADPD4000DCBSIZE);
         p_resp_payload->num_tx_pkts = num_pkts;
         for (i = 0; i < p_resp_payload->size; i++) {
            p_resp_payload->dcfgdata[i] = dcfgdata[dcfg_array_index++];
         }
         if(p != num_pkts-1) {
           p_resp_pkt->src = p_pkt->dest;
           p_resp_pkt->dest = p_pkt->src;
           p_resp_payload->status = status;
           p_resp_payload->command = M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
           post_office_send(p_resp_pkt, &err);

           /* Delay is kept same as what is there in low touch task */
           MCU_HAL_Delay(60);

