ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
           PKT_MALLOC(p_resp_pkt, m2m2_sensor_dcfg_data_t, 0);
           if(NULL != p_resp_pkt) {
             // Declare a pointer to the response packet payload
             PYLD_CST(p_resp_pkt, m2m2_sensor_dcfg_data_t, p_resp_payload);
             memset(p_resp_payload->dcfgdata, 0, sizeof(p_resp_payload->dcfgdata));

           }//if(NULL != p_resp_pkt)
           else {
             return NULL;
           }
         }
       }
      }else {
        p_resp_payload->size = 0;
        p_resp_payload->num_tx_pkts = 0;
        status = M2M2_APP_COMMON_STATUS_ERROR;
      }//if(read_adpd4000_dcfg())
    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Get ADPD4k app version
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_get_version(m2m2_hdr_t *p_pkt) {
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_version_t, 0);

  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_version_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->major = 0x00;
    p_resp_payload->minor = 0x03;
    p_resp_payload->patch = 0x01;
    memcpy(&p_resp_payload->verstr[0], "ADPD_App", 9);
    memcpy(&p_resp_payload->str[0], &GIT_ADPD4000_VERSION,
        GIT_ADPD4000_VERSION_LEN);
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->checksum = 0x0000;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Set/Get ADPD4k Slot parameters
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_slotmode(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  uint16_t slotFormat, channelNum, highestSelectedSlot;

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_adpd4000_slot_resp_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adpd4000_slot_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_adpd4000_slot_resp_t, p_resp_payload);

    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;

    switch (p_in_payload->command) {
    case M2M2_SENSOR_ADPD_COMMAND_SET_SLOT_REQ:

      if (p_in_payload->slot_enable == 0) {
        slotFormat = 0;
      } else {
        slotFormat = p_in_payload->slot_format;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_ADPD_COMMAND_SET_SLOT_RESP;
      if (p_in_payload->slot_num == 0 || p_in_payload->slot_num > SLOT_NUM) {
        p_resp_payload->status = status;
        return p_resp_pkt;
      }

      if (p_in_payload->channel_num == 1)
        channelNum = 1;
      else
        channelNum = 3; /* anything else sets to 3 */
      if (Adpd400xDrvSlotSetup(p_in_payload->slot_num - 1,
              p_in_payload->slot_enable, p_in_payload->slot_format,
              channelNum) != ADPD400xDrv_SUCCESS)
        break;
      p_resp_payload->slot_num = p_in_payload->slot_num;
      p_resp_payload->slot_enable = p_in_payload->slot_enable;
      p_resp_payload->slot_format = p_in_payload->slot_format;
      p_resp_payload->channel_num = p_in_payload->channel_num;
      status = M2M2_APP_COMMON_STATUS_OK;
      reset_adpd_packetization();
      break;

    case M2M2_SENSOR_ADPD_COMMAND_GET_SLOT_REQ:
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_ADPD_COMMAND_GET_SLOT_RESP;

      if (p_in_payload->slot_num == 0 || p_in_payload->slot_num > SLOT_NUM) {
        p_resp_payload->status = status;
        return p_resp_pkt;
      }
      if (Adpd400xDrvGetParameter(ADPD400x_LATEST_SLOT_DATASIZE,
              p_in_payload->slot_num - 1, &slotFormat) != ADPD400xDrv_SUCCESS)
        break;
      if (Adpd400xDrvGetParameter(ADPD400x_THIS_SLOT_CHANNEL_NUM,
              p_in_payload->slot_num - 1, &channelNum) != ADPD400xDrv_SUCCESS)
        break;
      if (Adpd400xDrvGetParameter(ADPD400x_HIGHEST_SLOT_NUM,
              p_in_payload->slot_num - 1,
              &highestSelectedSlot) != ADPD400xDrv_SUCCESS)
        break;
      if ((p_in_payload->slot_num - 1) <= highestSelectedSlot)
        p_resp_payload->slot_enable = 1;
      else
        p_resp_payload->slot_enable = 0;
      status = M2M2_APP_COMMON_STATUS_OK;
      p_resp_payload->slot_num = p_in_payload->slot_num;
      p_resp_payload->slot_format = slotFormat;
      p_resp_payload->channel_num = (uint8_t)channelNum;

      break;
    }
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Set/Get ADPD4k Active Slot
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_slot_active_mode(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  uint16_t slotActive;

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_adpd4000_slot_active_resp_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adpd4000_slot_active_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(
        p_resp_pkt, m2m2_sensor_adpd4000_slot_active_resp_t, p_resp_payload);

    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;

