ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
    switch (p_in_payload->command) {
    case M2M2_SENSOR_ADPD_COMMAND_SET_SLOT_ACTIVE_REQ:
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)
          M2M2_SENSOR_ADPD_COMMAND_SET_SLOT_ACTIVE_RESP;
      if (p_in_payload->slot_num == 0 || p_in_payload->slot_num > SLOT_NUM) {
        p_resp_payload->status = status;
        return p_resp_pkt;
      }
      if (Adpd400xDrvSlotSetActive(p_in_payload->slot_num - 1,
              p_in_payload->slot_active) != ADPD400xDrv_SUCCESS)
        break;
      p_resp_payload->slot_num = p_in_payload->slot_num;
      p_resp_payload->slot_active = p_in_payload->slot_active;
      status = M2M2_APP_COMMON_STATUS_OK;
      reset_adpd_packetization();
      break;
    case M2M2_SENSOR_ADPD_COMMAND_GET_SLOT_ACTIVE_REQ:
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)
          M2M2_SENSOR_ADPD_COMMAND_GET_SLOT_ACTIVE_RESP;
      if (p_in_payload->slot_num == 0 || p_in_payload->slot_num > SLOT_NUM) {
        p_resp_payload->status = status;
        return p_resp_pkt;
      }
      if (Adpd400xDrvGetParameter(ADPD400x_IS_SLOT_ACTIVE,
              p_in_payload->slot_num - 1, &slotActive) != ADPD400xDrv_SUCCESS)
        break;
      status = M2M2_APP_COMMON_STATUS_OK;
      p_resp_payload->slot_num = p_in_payload->slot_num;
      p_resp_payload->slot_active = slotActive;

      break;
    }

    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Do ADPD4k Clock Calibration
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
uint32_t clock_cal=0;
#endif
static m2m2_hdr_t *adpd_app_do_clock_cal(m2m2_hdr_t *p_pkt) {
  m2m2_sensor_clockcal_resp_t *clockcal =
      (m2m2_sensor_clockcal_resp_t *)&p_pkt->data[0];
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_clockcal_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_clockcal_resp_t, p_resp_payload);
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    if (g_state.num_starts == 0) {
      if (Adpd4000DoClockCalibration(clockcal->clockcalid) == 0) {
#ifdef ADPD_SEM_CORRUPTION_DEBUG
        clock_cal += 1;
#endif
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
      } else {
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    }
    Adpd400xDrvDataReadyCallback(adpd_data_ready_cb);
    p_resp_payload->clockcalid = clockcal->clockcalid;
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_CLOCK_CAL_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Get ADPD4k communication mode
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_get_com_mode(m2m2_hdr_t *p_pkt) {
  uint16_t nDevId;
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_com_mode_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_com_mode_resp_t, p_resp_payload);
    Adpd400xDrvRegRead(ADPD400x_REG_CHIP_ID, &nDevId);
    if ((nDevId & 0xC0) == 0xC0) {
      p_resp_payload->com_mode = Adpd400xDrvGetComMode() + 1;
    } else {
      p_resp_payload->com_mode = 0x0;
    }
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMUNICATION_MODE_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Load ADPD4k DCFG
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
 uint32_t load_adpd_cfg=0;
#endif
static m2m2_hdr_t *adpd_app_load_cfg(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_adpd_resp_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adpd_resp_t, 0);

  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_adpd_resp_t, p_resp_payload);
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    uint16_t device_id = p_in_payload->deviceid;
    if (g_state.num_starts == 0) {
      if (!load_adpd4000_cfg(device_id)) { /* Loads the device configuration */
#ifdef ADPD_SEM_CORRUPTION_DEBUG
        load_adpd_cfg += 1;
#endif
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
        external_load_dcfg = true;
      } else {
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    }
    p_resp_payload->deviceid = device_id;
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_LOAD_CFG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Get ADPD4k running/subscription status
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_status(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_status_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);
    uint8_t i=0;

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

