ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
    if (g_state.num_starts == 0) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
    }

    //Get the index of the slot
    i = p_in_payload->stream - M2M2_ADDR_SENSOR_ADPD_STREAM1;

    p_resp_payload->stream = p_in_payload->stream;

    p_resp_payload->num_subscribers = g_state.num_subs[i];
    p_resp_payload->num_start_reqs = g_state.num_starts;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/*!
  ****************************************************************************
* @brief Interface for m2m2 cmd request and response to start/stop ADPD4k stream
         and add/remove Subscription to it
*
* @param[in]           p_pkt: input m2m2 packet
*
* @return              pointer to reponse m2m2 packet
*****************************************************************************/
static m2m2_hdr_t *adpd_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t command;
  uint8_t sl_num;
  uint8_t clockcalid;
  /*Keeping nRetCode as success by default, to handle else part
    of if(!adpd_app_timings.delayed_start) */
  int16_t nRetCode = ADPD400xDrv_SUCCESS;

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
/*
      if (
#ifdef ENABLE_ECG_APP
      g_state_ecg.num_starts == 0 &&
#endif
#ifdef ENABLE_EDA_APP
      1 && g_state_eda.num_starts == 0 &&
#endif
#ifdef ENABLE_BIA_APP
      1 && g_state_bia.num_starts == 0 &&
#endif
      1 ) {
        // switch on ECG ldo 
        adp5360_enable_ldo(ECG_LDO, true);
#ifdef ENABLE_BIA_APP
        DG2502_SW_control_AD5940(false);
#endif
#ifdef ENABLE_ECG_APP
        DG2502_SW_control_AD8233(false);
#endif
        // de init power 
        adp5360_enable_ldo(ECG_LDO, false);
      } else if (
#ifdef ENABLE_ECG_APP
      g_state_ecg.num_starts == 0 && (
#else
      (
#endif
#ifdef ENABLE_EDA_APP
      g_state_eda.num_starts > 0 ||
#endif
#ifdef ENABLE_BIA_APP
      g_state_bia.num_starts > 0 ||
#endif
      0 )) {
#ifndef CUST4_SM
        DG2502_SW_control_AD5940(false);
#endif
#ifdef ENABLE_ECG_APP
#ifndef CUST4_SM
        DG2502_SW_control_AD8233(false);
#endif
#endif
      }
*/
      gsOneTimeValueWhenReadAdpdData = 0;
      if (g_state.num_starts == 0) {
#ifdef ENABLE_PPG_APP

        /*! Initialize the PPG LCFG so that ADPD application works with PPG
            DCB contents, if PPG DCB is present */
        if(ppg_get_dcb_present_flag() == true)
        {
          MwPpg_LoadppgLCFG(M2M2_SENSOR_PPG_LCFG_ID_ADPD4000);
        }

        if(gn_uc_hr_enable)
        {
          uint32_t temp_val;
          MwPPG_ReadLCFG(4, &temp_val);/*! To read featureSelect */
          gPpg_agc_en = ((uint16_t)temp_val & (uint16_t)(STATIC_AGC_EN)) >> STATIC_AGC_BIT_P;
          gn_led_slot_g = (gPpg_agc_en == 1) ? (1 << (gn_uc_hr_slot - 1)) : 0;
          if(gPpg_agc_en)
          {
            gn_agc_active_slots |= (1 << (gn_uc_hr_slot - 1));
          }
          gRun_agc = (gn_agc_active_slots != 0) ? true: false;
          gPpg_agc_done = 0;
          MwPPG_HeartRateInit();
          Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE);
          SyncInit();
        }
#endif
        /*
           Before ADPD sensor is started, we need to check & give loadAdpdDcfg
           & clockCalibration cmd, if required. This is becasue WT doesnt give
           this cmd explicitly and hence needs to be handled in f/w
           Following flags are added for the same:
             *adpd4000_get_dcb_present_flag()  -> returns true if DCB is present
             *check_dcb_erase -> this flag is true following DCB erase m2m2 cmd
             *external_load_dcfg -> if this flag is true, which happens if
               loadAdpdDcfg cmd is issued explicityly, no need to do code block
        */
#ifdef DCB
        if ((adpd4000_get_dcb_present_flag() || check_dcb_erase == true) &&
            (external_load_dcfg == false)) {
          if (load_adpd4000_cfg(M2M2_SENSOR_ADPD4000_DEVICE_4000_G) !=
              ADPD4000_DCFG_STATUS_OK) {
            Debug_Handler();
          }

          /*On DVT2 with ADPD4100, clock calibration with clk id = 2 works*/
          if(dvt2)
            clockcalid = 2;
          /*On DVT1 & other boards with ADPD4000, clock calibration with clk id = 6 works*/
          else
            clockcalid = 6;

          if (Adpd4000DoClockCalibration(clockcalid) != 0) {
            Debug_Handler();
          }

          if (check_dcb_erase == true) {
            check_dcb_erase = false;
          }
        }
        external_load_dcfg = false;
        Adpd400xDrvSetParameter(ADPD400x_WATERMARKING, 0, 4);
        Adpd400xDrvDataReadyCallback(adpd_data_ready_cb);
        reset_adpd_packetization();
        /* Reset the Interrupt Status variables */
        _PreviousStatus.level0_int = 1;
        _PreviousStatus.level1_int = 1;
        _PreviousStatus.tia_ch1_int = 1;
        _PreviousStatus.tia_ch2_int = 1;
        for (int i = 0; i < TOTAL_SLOT; i++) {
          if (g_state.sl_pktizer1[i].p_pkt != NULL) {
            post_office_consume_msg(g_state.sl_pktizer1[i].p_pkt);
            g_state.sl_pktizer1[i].p_pkt = NULL;
          }
          if (g_state.sl_pktizer2[i].p_pkt != NULL) {
            post_office_consume_msg(g_state.sl_pktizer2[i].p_pkt);
            g_state.sl_pktizer2[i].p_pkt = NULL;
          }
        }
#endif
        g_adpd_odr = get_adpd_odr();
//        Adpd400xDrvRegWrite(ADPD400x_REG_GPIO01,0x0302);
        enable_ext_syncmode();
        enable_adpd_ext_trigger(g_adpd_odr);
#ifdef USER0_CONFIG_APP
        get_adpd_app_timings_from_user0_config_app_lcfg(&adpd_app_timings.start_time,\
                                      &adpd_app_timings.on_time, &adpd_app_timings.off_time);
        if(adpd_app_timings.start_time > 0)
        {
          adpd_app_timings.delayed_start = true;
        }
#ifdef LOW_TOUCH_FEATURE
        //ADPD app not in continuous mode & its interval operation mode
        if(!is_adpd_app_mode_continuous() && !(get_low_touch_trigger_mode3_status()))
#else
        //ADPD app not in continuous mode
        if(!is_adpd_app_mode_continuous())
#endif

        {
          start_adpd_app_timer();
        }

        if(!adpd_app_timings.delayed_start)
        {
          nRetCode = Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE);
          adpd_app_timings.app_mode_on = true;
        }
        if(ADPD400xDrv_SUCCESS == nRetCode) {
#else
        if(ADPD400xDrv_SUCCESS == Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE)) {
#endif// USER0_CONFIG_APP
          g_state.num_starts = 1;
          status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
        } else {
          status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
        }
      } else {
#ifdef ENABLE_TEMPERATURE_APP
        /* if Temperarture stream is already running,
           then set the correct LED current because it was set to 0
           during temperature stream start */
        if ((gsTemperatureStarts > 0) &&
            (gsTemperatureStarts == g_state.num_starts)) {
#ifndef SLOT_SELECT
          for (uint8_t i = 0; i < SLOT_NUM; i++) {
            g_adpd_reg_base = i * ADPD400x_SLOT_BASE_ADDR_DIFF;
            Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_adpd_reg_base,
                led_reg.reg_val[i].reg_pow12);
            Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_adpd_reg_base,
                led_reg.reg_val[i].reg_pow34);
          }
#endif
         }
#endif
        g_state.num_starts++;
        status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
#ifdef USER0_CONFIG_APP
        get_adpd_app_timings_from_user0_config_app_lcfg(&adpd_app_timings.start_time,\
                                      &adpd_app_timings.on_time, &adpd_app_timings.off_time);
        if(adpd_app_timings.start_time > 0)
        {
          adpd_app_timings.delayed_start = true;
        }

#ifdef LOW_TOUCH_FEATURE
        //ADPD app not in continuous mode & its interval operation mode
        if(!is_adpd_app_mode_continuous() && !(get_low_touch_trigger_mode3_status()))
#else
        //ADPD app not in continuous mode
        if(!is_adpd_app_mode_continuous())
#endif
        {
          start_adpd_app_timer();
        }

        if(!adpd_app_timings.delayed_start)
        {
          adpd_app_timings.app_mode_on = true;
          ;//TODO: Check and handle ADPD sample mode/idle mode switching
        }
#endif// USER0_CONFIG_APP
      }
      command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
      gsOneTimeValueWhenReadAdpdData = 0;

      if (1 == gbAdpdHighPrio) {
        adi_osal_ThreadSetPrio(NULL, APP_OS_CFG_SENSOR_ADPD4000_TASK_PRIO);
        gbAdpdHighPrio = 0;
      }
      /* reset the sample count after the stream has stopped*/
      gsResetStaticAgcSampleCnt = 0;

