ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
      if (g_state.num_starts == 0) {
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } else if (g_state.num_starts == 1) {
        disable_ext_syncmode(); /*! Disable ext sync mode*/
        g_adpd_odr = get_adpd_odr();
        disable_adpd_ext_trigger(g_adpd_odr);
        if (ADPD400xDrv_SUCCESS ==
            Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE)) {
          g_state.num_starts = 0;
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
          external_load_dcfg = false;
          reset_agc_flags();/**reset AGC flags **/

          reset_adpd_packetization();
          for (int i = 0; i < TOTAL_SLOT; i++) {
            if (g_state.sl_pktizer1[i].p_pkt != NULL) {
              post_office_consume_msg(g_state.sl_pktizer1[i].p_pkt);
              g_state.sl_pktizer1[i].p_pkt = NULL;
            }
            if (g_state.sl_pktizer2[i].p_pkt != NULL) {
              post_office_consume_msg(g_state.sl_pktizer2[i].p_pkt);
              g_state.sl_pktizer2[i].p_pkt = NULL;
            }
          }
#ifdef USER0_CONFIG_APP
          if(adpd_app_timings.check_timer_started)
          {
            adpd_timer_stop();
            adpd_app_timings.on_time_count = 0;
            adpd_app_timings.off_time_count = 0;
            adpd_app_timings.start_time_count = 0;
            adpd_app_timings.delayed_start =  false;
          }
#endif//USER0_CONFIG_APP
        } else {
          g_state.num_starts = 1;
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
#ifdef ENABLE_PPG_APP
        if(gn_uc_hr_enable)
        {
          gPpg_agc_en = 0;
          gPpg_agc_done = 0;
          MwPPG_HeartRateDeInit();
          gn_uc_hr_slot = ADPD4K_SLOT_F; //Slot F
        }
#endif
      } else {
        g_state.num_starts--;
#ifdef ENABLE_TEMPERATURE_APP
        if ((g_state.num_starts > 0) &&
            (g_state.num_starts == gsTemperatureStarts)) {
#ifndef SLOT_SELECT
          for (uint8_t i = 0; i < SLOT_NUM; i++) {
            g_adpd_reg_base = i * ADPD400x_SLOT_BASE_ADDR_DIFF;
            if (Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_adpd_reg_base,
                    &led_reg.reg_val[i].reg_pow12) == ADPD400xDrv_SUCCESS) {
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_adpd_reg_base, 0x0);
            } /* disable led for slot-A - I */

            if (Adpd400xDrvRegRead(ADPD400x_REG_LED_POW34_A + g_adpd_reg_base,
                    &led_reg.reg_val[i].reg_pow34) == ADPD400xDrv_SUCCESS) {
              Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW34_A + g_adpd_reg_base, 0x0);
            } /* disable led for slot-> A - I */
          }
#endif
        }
#endif//ENABLE_TEMPERATURE_APP
        status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
      /* Get the slot number for every subscription. */
      if (p_in_payload->stream == M2M2_ADDR_SENSOR_ADPD_OPTIONAL_BYTES_STREAM) {
        /* Enable Stream Flag */
        bIsStatusStreamEnabled = true;
        /* Reset the Interrupt Status variables */
        _PreviousStatus.level0_int = 1;
        _PreviousStatus.level1_int = 1;
        _PreviousStatus.tia_ch1_int = 1;
        _PreviousStatus.tia_ch2_int = 1;
      } else {
        sl_num = p_in_payload->stream - M2M2_ADDR_SENSOR_ADPD_STREAM1;
        g_state.num_subs[sl_num]++;
        if(g_state.num_subs[sl_num] == 1)
        {
          /* reset pkt sequence no. only during 1st sub request */
          g_state.data_pkt_seq_num[sl_num][CH1] = 0;
          g_state.data_pkt_seq_num[sl_num][CH2] = 0;
        }
        //Check if no: of subscribers are more than 1, for all slots
        uint8_t i;
        // Go through total adpd slots
        gb_adpd_multi_sub_start = 0;
        for (i = 0; i < SLOT_NUM; i++) {
          if (g_state.num_subs[i] >= 1) {
            gb_adpd_multi_sub_start = 1;
            break;
          }
        }
      }
      post_office_setup_subscriber(
          M2M2_ADDR_SENSOR_ADPD4000, p_in_payload->stream, p_pkt->src, true);
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
      command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
      if (p_in_payload->stream == M2M2_ADDR_SENSOR_ADPD_OPTIONAL_BYTES_STREAM) {
        bIsStatusStreamEnabled = false;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      } else {
        sl_num = p_in_payload->stream - M2M2_ADDR_SENSOR_ADPD_STREAM1;
        if (g_state.num_subs[sl_num] <= 1) {
          g_state.num_subs[sl_num] = 0;
          status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
        } else {
          g_state.num_subs[sl_num]--;
          status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
        }
      }
      post_office_setup_subscriber(
          M2M2_ADDR_SENSOR_ADPD4000, p_in_payload->stream, p_pkt->src, false);
      command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
      //Check if no: of subscribers are more than 1, for all slots
      uint8_t i;
      // Go through total adpd slots
      gb_adpd_multi_sub_start = 0;
      for (i = 0; i < SLOT_NUM; i++) {
        if (g_state.num_subs[i] >= 1) {
          gb_adpd_multi_sub_start = 1;
          break;
        }
      }
      break;

    default:
      post_office_consume_msg(p_resp_pkt);
      return NULL;
      break;
    }
    p_resp_payload->command = command;
    p_resp_payload->status = status;
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  } // if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Set ADPD4k operation mode to pause/ unpause
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_set_pause(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_adpd4000_resp_t, p_in_payload);

  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adpd4000_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_adpd4000_resp_t, p_resp_payload);

    memset(p_resp_payload,0,sizeof(m2m2_sensor_adpd4000_resp_t));
    p_resp_payload->deviceid = M2M2_SENSOR_ADPD4000_DEVICE_4000_G_R_IR_B;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    /*Pause bit is expected to be either 1 or 0;
      1 for Pause/Idle mode ;
      0 for Unpause/Sample mode*/

    if((p_in_payload->retdata[0]) == 0x1)
    {
      if ((g_state.num_starts !=0) && (gAdpdPause == false))
      {
        /*Put the device into Idle mode*/
        if (Adpd400xDrvSetOperationPause(0) == ADPD400xDrv_SUCCESS)
        {
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          gAdpdPause = true;
        }
      }
    } else if((p_in_payload->retdata[0]) == 0x0)
    {
      if ((g_state.num_starts !=0) && (gAdpdPause == true))
      {
        /*Put the device into Sample mode*/
        if (Adpd400xDrvSetOperationPause(1) == ADPD400xDrv_SUCCESS)
        {
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          gAdpdPause = false;
        }
      }
    }
    else
    {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    }

    p_resp_payload->retdata[0] = p_in_payload->retdata[0];
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_SET_PAUSE_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    gsOneTimeValueWhenReadAdpdData = 0;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Read/Write ADPD4k registers
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
uint32_t reg_write_cnt=0;
#endif
static m2m2_hdr_t *adpd_app_reg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_in_payload);
  /* Allocate a response packet
     with space for the correct number of operations */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_resp_payload);
    uint16_t reg_data = 0;

