ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
  PYLD_CST(p_pkt, m2m2_sensor_adpd_testcommand_resp_t, p_in_payload);

  switch (p_in_payload->retdata[0]) {
  case 0:
    break;
  case 1:
    break;
  case 2:
    fetch_adpd_data();
    break;
  case 3:
    Adpd400xDrvRegWrite(0, 0x8000); /* Clear FIFO */
    break;
  case 4:
    Adpd400xDrvRegWrite(1, 0x8000); /* Clear FIFO status */
    break;
  default:
    break;
  }

  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adpd_testcommand_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_adpd_testcommand_resp_t, p_resp_payload);
    /* p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR; */

    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->retdata[0] = 0x11223344;
    p_resp_payload->retdata[1] = 0xaabbccdd;
    p_resp_payload->retdata[2] = 12345678;
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_DO_TEST1_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

#ifdef ENABLE_PPG_APP
/*!
 ****************************************************************************
 * @brief Set UC1,2,3,5 HR calculation to enable/dsisable
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_uc_hr_enable(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_pkt, m2m2_adpd_set_uc_hr_enab_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_adpd_set_uc_hr_enab_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_adpd_set_uc_hr_enab_t, p_resp_payload);

    gn_uc_hr_enable = p_in_payload->control;
    gn_uc_hr_slot =  p_in_payload->slotNum;

    //Cleat all flags used in UC HR
    gnHRAdpdSampleCount = 0;
    gnHRAdxlSampleCount = 0;

    gnAppSyncTimerStarted = 0;

    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_UC_HR_ENAB_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->control = p_in_payload->control;
    p_resp_payload->slotNum = p_in_payload->slotNum;
  }
  return p_resp_pkt;
}
#endif

/*!
 ****************************************************************************
 * @brief Set AGC ON/OFF for each of the four LEDs in ADPD4k
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_agc_on_off_cntrl(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_pkt, m2m2_adpd_agc_cntrl_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_adpd_agc_cntrl_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_adpd_agc_cntrl_t, p_resp_payload);

    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_AGC_ON_OFF_RESP;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    for (uint8_t i = 0; i < p_in_payload->num_ops; i++) {
      p_resp_payload->ops[i].agc_cntrl = p_in_payload->ops[i].agc_cntrl;
      p_resp_payload->ops[i].agc_type = p_in_payload->ops[i].agc_type;
    }

    /* Turn ON STATIC_AGC */
    for (uint8_t i = 0; i < p_in_payload->num_ops; i++) {
      switch (p_in_payload->ops[i].agc_type) {
      case 0: /* MWL view */
      {
        if (p_in_payload->ops[i].agc_cntrl) /* AGC_ON */
        {
#ifndef SLOT_SELECT
          gn_led_slot_g = G_LED_AGC_SLOTS;
          gn_led_slot_r = R_LED_AGC_SLOTS;
          gn_led_slot_ir = IR_LED_AGC_SLOTS;
          gn_led_slot_b = B_LED_AGC_SLOTS;
#endif
        }
        else
        {
          gn_led_slot_g = 0;
          gn_led_slot_r = 0;
          gn_led_slot_ir = 0;
          gn_led_slot_b = 0;
        }
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          break;
      }
      case 1: /* Green LED */
      {
        if (p_in_payload->ops[i].agc_cntrl)
         {
#ifndef SLOT_SELECT
           gn_led_slot_g = G_LED_AGC_SLOTS;
#endif
         }
         else
         {
           gn_led_slot_g = 0;
         }
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          break;
      }
      case 2: /* Red LED */
      {
        if (p_in_payload->ops[i].agc_cntrl)
         {
#ifndef SLOT_SELECT
           gn_led_slot_r = R_LED_AGC_SLOTS;
#endif
         }
         else
         {
           gn_led_slot_r = 0;
         }
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          break;
      }
      case 3: /* IR LED */
      {
        if (p_in_payload->ops[i].agc_cntrl)
         {
#ifndef SLOT_SELECT
           gn_led_slot_ir = IR_LED_AGC_SLOTS;
#endif
         }
         else
         {
           gn_led_slot_ir = 0;
         }
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          break;
      }
      case 4: /* Blue LED */
      {
        if (p_in_payload->ops[i].agc_cntrl)
         {
#ifndef SLOT_SELECT
           gn_led_slot_b = B_LED_AGC_SLOTS;
#endif
         }
         else
         {
           gn_led_slot_b = 0;
         }
          p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
          break;
      }
      default: {
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
        break;
      }
      } // switch case
    }   // for loop
    gn_agc_active_slots = gn_led_slot_g |  gn_led_slot_r | gn_led_slot_ir | gn_led_slot_b;
    gRun_agc = (gn_agc_active_slots != 0) ? true: false;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  } // if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Get AGC Settings done in ADPD4k
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_agc_info(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to the response packet payload */
  PYLD_CST(p_pkt, m2m2_adpd_agc_info_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_adpd_agc_info_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_adpd_agc_info_t, p_resp_payload);

    p_resp_payload->led_index = p_in_payload->led_index;
    get_agc_info(p_resp_payload);
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_payload->command = M2M2_SENSOR_ADPD_COMMAND_AGC_INFO_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
  }
  return p_resp_pkt;
}

