ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
#ifdef DCB
/*!
 ****************************************************************************
 * @brief Read ADPD4K DCB Configuration
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_dcb_command_read_config(m2m2_hdr_t *p_pkt)
{
    uint16_t r_size;
    uint16_t i = 0, num_pkts = 0, dcbdata_index = 0;

    /* dcbdata - storage for DCB content during READ DCB block
     * for Gen block DCB; Reusing the RAM buffer from system task,
     * instead of declaring it in the function,
     * saves space on Stack requirement from LT Task
     */
    uint32_t *dcbdata = (uint32_t *)&gsConfigTmpFile[0];
    ADI_OSAL_STATUS  err;
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

    PKT_MALLOC(p_resp_pkt, m2m2_dcb_adpd4000_data_t, 0);
    if(p_resp_pkt != NULL )
    {
       // Declare a pointer to the response packet payload
       PYLD_CST(p_resp_pkt, m2m2_dcb_adpd4000_data_t, p_resp_payload);
       memset(p_resp_payload->dcbdata, 0, sizeof(p_resp_payload->dcbdata));
       memset(dcbdata, 0, sizeof(dcbdata));
       r_size = (uint16_t)(MAXADPD4000DCBSIZE*MAX_ADPD4000_DCB_PKTS); //Max words that can be read from FDS
       if(read_adpd4000_dcb(&dcbdata[0], &r_size) == ADPD4000_DCB_STATUS_OK)
       {
         status = M2M2_DCB_STATUS_OK;
         num_pkts = (r_size / MAXADPD4000DCBSIZE) + ((r_size % MAXADPD4000DCBSIZE) ? 1 : 0 );
         dcbdata_index = 0;
         for(uint16_t p = 0; p < num_pkts; p++)
         {
      	   p_resp_payload->size = \
                (p != num_pkts-1) ? MAXADPD4000DCBSIZE : (r_size % MAXADPD4000DCBSIZE);
      	   p_resp_payload->num_of_pkts = num_pkts;
           for (i = 0; i < p_resp_payload->size; i++)
           {
      	      p_resp_payload->dcbdata[i] = dcbdata[dcbdata_index++];
           }
           if(p != num_pkts-1)
      	   {
             p_resp_pkt->src = p_pkt->dest;
      	     p_resp_pkt->dest = p_pkt->src;
             p_resp_payload->status = status;
             p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
      	     post_office_send(p_resp_pkt, &err);

      	     /* Delay is kept same as what is there in low touch task */
      	     MCU_HAL_Delay(60);

      	     PKT_MALLOC(p_resp_pkt, m2m2_dcb_adpd4000_data_t, 0);
      	     if(NULL != p_resp_pkt)
      	     {
               // Declare a pointer to the response packet payload
               PYLD_CST(p_resp_pkt, m2m2_dcb_adpd4000_data_t, p_resp_payload);
               memset(p_resp_payload->dcbdata, 0, sizeof(p_resp_payload->dcbdata));
      	     }//if(NULL != p_resp_pkt)
      	     else
      	     {
               return NULL;
      	     }
      	   }
         }
        }
        else
        {
            p_resp_payload->size = 0;
            p_resp_payload->num_of_pkts = 0;
            status = M2M2_DCB_STATUS_ERR_ARGS;
        }//if(read_adpd4000_dcb())
        p_resp_payload->status = status;
        p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
        p_resp_pkt->src = p_pkt->dest;
        p_resp_pkt->dest = p_pkt->src;
    }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Write ADPD4K DCB Configuration
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_dcb_command_write_config(m2m2_hdr_t *p_pkt)
{
    M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
    static uint16_t i = 0;
    static uint16_t num_of_pkts = 0;
    uint16_t j;
    /* dcbdata - storage for DCB content during write DCB block
     * for Gen block DCB. Reusing the RAM buffer from system task,
     * instead of declaring a static buffer in the function,
     * saves space on total RAM usage from the watch application
     */
    uint32_t *dcbdata = (uint32_t *)&gsConfigTmpFile[0];

    // Declare a pointer to access the input packet payload
    PYLD_CST(p_pkt, m2m2_dcb_adpd4000_data_t, p_in_payload);
    PKT_MALLOC(p_resp_pkt, m2m2_dcb_adpd4000_data_t, 0);
    if(p_resp_pkt != NULL )
    {
        // Declare a pointer to the response packet payload
        PYLD_CST(p_resp_pkt, m2m2_dcb_adpd4000_data_t, p_resp_payload);

        //Maximum two packets can be written to ADPD4000_DCB
        if(p_in_payload->num_of_pkts >= 1 && p_in_payload->num_of_pkts <= MAX_ADPD4000_DCB_PKTS)
        {
            num_of_pkts += 1;
            for( j=0; j<p_in_payload->size; j++ )
              dcbdata[i++] = p_in_payload->dcbdata[j];
            NRF_LOG_INFO("Wr DCB:pkt sz->%d, arr index=%d",p_in_payload->size,i);
            if(num_of_pkts == p_in_payload->num_of_pkts)
            {
                if(write_adpd4000_dcb(&dcbdata[0], i) == ADPD4000_DCB_STATUS_OK)
                {
                    adpd4000_set_dcb_present_flag(true);
                    status = M2M2_DCB_STATUS_OK;
                }
                else
                {
                    status = M2M2_DCB_STATUS_ERR_ARGS;
                }
                num_of_pkts = 0;
                i=0;
            }
            else
              status = M2M2_DCB_STATUS_OK;
        }
        else
        {
            status = M2M2_DCB_STATUS_ERR_ARGS;
        }

        p_resp_payload->status = status;
        p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
        p_resp_payload->size = 0;
        p_resp_payload->num_of_pkts = p_in_payload->num_of_pkts;
        for(uint16_t k=0; k < MAXADPD4000DCBSIZE; k++)
           p_resp_payload->dcbdata[k] = 0;
        p_resp_pkt->src = p_pkt->dest;
        p_resp_pkt->dest = p_pkt->src;
    }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Delete ADPD4K DCB Configuration
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_dcb_command_delete_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_adpd4000_data_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_adpd4000_data_t, p_resp_payload);

    if (delete_adpd4000_dcb() == ADPD4000_DCB_STATUS_OK) {
      adpd4000_set_dcb_present_flag(false);
      check_dcb_erase = true;
      status = M2M2_DCB_STATUS_OK;
    } else {
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i< MAXADPD4000DCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}
#endif

/*!
 ****************************************************************************
 * @brief Callback function for ADPD4k FIFO Interrupt
 *
 * @param[in]    None
 *
 * @return       None
 *****************************************************************************/
#ifdef ADPD_SEM_CORRUPTION_DEBUG
uint32_t g_adpd_isr_list[40] = {0};
uint8_t adpd_list_index = 0;
#endif
static void adpd_data_ready_cb(void) {
  /* Get the RTC timestamp at the time the ADPD data ready interrupt happened */
  gADPD4000_dready_ts = get_sensor_time_stamp();
#ifdef ADPD_SEM_CORRUPTION_DEBUG
 g_adpd_isr_list[adpd_list_index++] = gADPD4000_dready_ts;
  if (adpd_list_index >=40)
    adpd_list_index =0;
#endif
  g_time_diff = gADPD4000_dready_ts - gADPD4000_dready_ts_prev;
  gAdpdIntCnt++;
  adi_osal_SemPost(adpd4000_task_evt_sem);
  gADPD4000_dready_ts_prev = gADPD4000_dready_ts;
}

/*!
 ****************************************************************************
 * @brief ADPD400x _OptionalByteArrange
 *
 * @param[in]         pnData: data pointer reference
 * @param[in]         nRegValue: Optional byte register value
 * @param[in]         timestamp: input m2m2 packet
 * @param[out]        pData: input m2m2 packet
 *
 * @return            bool
 *****************************************************************************/
static bool _OptionalByteArrange(uint8_t *pnData, uint16_t nRegValue,
    uint32_t timestamp, m2m2_hdr_t *pData) {
  /* Flag for returns */
  bool _bFlag = false;
  /* Declare a pointer to the p_payload_ptr */
  PYLD_CST(pData, m2m2_sensor_fifo_status_bytes_t, p_payload_ptr);
  /* Clear the specified memory block */
  memset(p_payload_ptr, 0x00, sizeof(m2m2_sensor_fifo_status_bytes_t));
  p_payload_ptr->command =
      (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
  p_payload_ptr->status =
      (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
  /* Assign timestamp to payload pointer */
  p_payload_ptr->timestamp = timestamp;
  /* Run the loop to get all optinal byte status from FIFO */
  for (uint8_t nIndex = 0; nIndex <= 8; nIndex++) {
    switch (nRegValue & 0x01 << nIndex) {
    case 0x01:
      /* Sequence Number Enabled */
      p_payload_ptr->sequence_num = *pnData & 0x0f;
      pnData++;
      break;
    case 0x02:
      /* Data INT Enabled Slot A-H */
      p_payload_ptr->data_int = *pnData;
      pnData++;
      break;
    case 0x04:
      /* Data INT Enabled Slot I-L */
      p_payload_ptr->data_int = *pnData;
      pnData++;
      break;
    case 0x08:
      /* Level 0 INT Enabled Slot A-H */
      p_payload_ptr->level0_int = *pnData;
      pnData++;
      break;
    case 0x10:
      /* Level 1 INT Enabled Slot A-H */
      p_payload_ptr->level1_int = *pnData;
      pnData++;
      break;
    case 0x20:
      /* Level 0 & 1 Enabled Slot I-L */
      p_payload_ptr->level0_int |= ((*pnData & 0x0f) << 8);
      *pnData = (*pnData & 0xf0) >> 4;
      p_payload_ptr->level1_int |= (*pnData << 8);
      pnData++;
      break;
    case 0x40:
      /* Tia saturation Ch1 INT for Slot A-H */
      p_payload_ptr->tia_ch1_int = *pnData;
      pnData++;
      break;
    case 0x80:
      /* Tia saturation Ch2 INT for Slot A-H */
      p_payload_ptr->tia_ch2_int = *pnData;
      pnData++;
      break;
    case 0x100:
      /* Tia saturation Ch1 & Ch2 INT for Slot I-L */
      p_payload_ptr->tia_ch1_int |= ((uint16_t)(*pnData & 0x0f) << 8);
      p_payload_ptr->tia_ch2_int |= ((uint16_t)(*pnData & 0xf0) << 8);
    default:
      break;
    }
  }
  if (_PreviousStatus.level0_int != p_payload_ptr->level0_int ||
      _PreviousStatus.level1_int != p_payload_ptr->level1_int ||
      _PreviousStatus.tia_ch1_int != p_payload_ptr->tia_ch1_int ||
      _PreviousStatus.tia_ch2_int != p_payload_ptr->tia_ch2_int) {
    /* Copy the current status into previous status array */
    _PreviousStatus.level0_int = p_payload_ptr->level0_int;
    _PreviousStatus.level1_int = p_payload_ptr->level1_int;
    _PreviousStatus.tia_ch1_int = p_payload_ptr->tia_ch1_int;
    _PreviousStatus.tia_ch2_int = p_payload_ptr->tia_ch2_int;
    _bFlag = true;
  } else {
    _bFlag = false;
  }

  return _bFlag;
}

/*!
 ****************************************************************************
 * @brief Read/Write ECG4k lcfg values
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *ecg4k_lcfg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, ecg_app_lcfg_op_hdr_t, p_in_payload);

  /* Allocate a response packet
     with space for the correct number of operations */
  PKT_MALLOC(p_resp_pkt, ecg_app_lcfg_op_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, ecg_app_lcfg_op_hdr_t, p_resp_payload);
    uint16_t reg_data = 0;

