ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000/adpd4000_task.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (Ecg4kgGetLCFG(p_in_payload->ops[i].field, &reg_data) ==
            ADPD4000_DCFG_STATUS_OK) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = reg_data;
        reg_data = 0;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;

    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (Ecg4kSetLCFG(p_in_payload->ops[i].field,
                p_in_payload->ops[i].value) == ADPD4000_DCFG_STATUS_OK) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;

    default:
      break;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  } // if(NULL != p_resp_pkt)

  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Set the Sampling Frequency for the ADPD4k
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *set_adpd4000_fs(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_adpd4000_set_fs_t, p_in_payload);
  /* Allocate a response packet
     with space for the correct number of operations */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adpd4000_set_fs_t, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_sensor_adpd4000_set_fs_t, p_resp_payload);

    if (Set_adpd4000_SamplingFreq(p_in_payload->odr) ==
        ADPD4000_DCFG_STATUS_OK) {
      status = M2M2_APP_COMMON_STATUS_OK;
    } else {
      status = M2M2_APP_COMMON_STATUS_ERROR;
    }

    p_resp_payload->command =
        (M2M2_SENSOR_ADPD_COMMAND_ENUM_t)M2M2_SENSOR_ADPD_COMMAND_SET_FS_RESP;

    p_resp_payload->odr = p_in_payload->odr;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 * @brief Get the ADPD4k Chip ID
 *
 * @param[in]   - None
 *
 * @return      - chipID
 *****************************************************************************/
uint16_t GetChipIdAdpd() {
  uint16_t nDevId = 0;
  /* 0xC0 - ADPD4000, 0x1C2 - ADPD4100 MLW*/
  Adpd400xDrvRegRead(ADPD400x_REG_CHIP_ID, &nDevId);
  return nDevId;
}

#ifdef ENABLE_SQI_APP
/*!
 ****************************************************************************
 * @brief Feed ADPD Data externally from logs
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_ext_adpd_datastream(m2m2_hdr_t *p_pkt) {

  // Declare a pointer to access the input packet payload
  PYLD_CST(p_pkt, adpd_ext_data_stream_t, p_in_payload);
  send_sqi_app_data(&p_in_payload->data,p_in_payload->timestamp);
  return NULL;

}
#endif

#ifdef ENABLE_SQI_APP
/*!
 ****************************************************************************
 * @brief Set ODR of externally fed ADPD data
 *
 * @param[in]           p_pkt: input m2m2 packet
 *
 * @return              pointer to reponse m2m2 packet
 *****************************************************************************/
static m2m2_hdr_t *adpd_app_set_ext_adpd_datastream_odr(m2m2_hdr_t *p_pkt) {

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, adpd_ext_data_stream_odr_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, adpd_ext_data_stream_odr_t, 0);

  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, adpd_ext_data_stream_odr_t, p_resp_payload);
    /* set adpd external data streaming flag to true */
    gAdpd_ext_data_stream_active = true;
    /* set adpd external data stream odr */
    gAdpd_ext_data_stream_odr = p_in_payload->sampling_freq;
    p_resp_payload->sampling_freq = gAdpd_ext_data_stream_odr;

    p_resp_payload->status =  M2M2_APP_COMMON_STATUS_OK;
    p_resp_payload->command = \
      (M2M2_SENSOR_ADPD_COMMAND_ENUM_t)M2M2_SENSOR_ADPD_COMMAND_SET_EXT_DATA_STREAM_ODR_RESP;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
  }

  return p_resp_pkt;
}
#endif
/*!
 ****************************************************************************
 * @brief Reset AGC related flags
 *
 * @param[in]           None
 *
 * @return              None
 *****************************************************************************/
void reset_agc_flags(void)
{
    gn_led_slot_g = 0;
    gn_led_slot_r = 0;
    gn_led_slot_ir = 0;
    gn_led_slot_b = 0;
    gn_agc_active_slots = 0;

    gRun_agc = false;
   /****************************/
}

#ifdef ENABLE_PPG_APP
/*!
 ****************************************************************************
 * @brief Update PPG settings for current and gain from lcfg if static agc disabled
 *
 * @param[in]    slot_id: specify slot used for PPG
                          (Default Slot-F, Slot_id = 5)
 *
 * @return       None
 *****************************************************************************/
static void update_ppg_default_current_gain(uint8_t slot_id){
uint32_t ReadLCFGvalue;
uint16_t nTIAgain = 0x0000;
uint16_t nTsCtrl = 0x0000;
uint8_t nCh2Enable = 0x00;
uint16_t CurrRegVal,nRegValue;

g_adpd_reg_base = log2(gAdpd400x_lcfg->targetSlots) * ADPD400x_SLOT_BASE_ADDR_DIFF;
MwPPG_ReadLCFG(32, &ReadLCFGvalue);/*! To read InitialCurrentTiaGain */
uint8_t nCurrVal = ReadLCFGvalue >> 8;// getting MSB 8bit
uint8_t nGainValue = ReadLCFGvalue & 0x003F; // previous Gain value will be maintained if the lcfg value not valid
Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_IDLE);

if(nCurrVal != 0){
  CurrRegVal = Adpd400xUtilGetRegFromMonotonicCurrent(nCurrVal);
  Adpd400xDrvRegRead(ADPD400x_REG_LED_POW12_A + g_adpd_reg_base, &nRegValue);
  nRegValue = nRegValue & (~BITM_LED_POW12_X_LED_CURRENT1_X);
  nRegValue |= CurrRegVal << BITP_LED_POW12_X_LED_CURRENT1_X;
  Adpd400xDrvRegWrite(ADPD400x_REG_LED_POW12_A + g_adpd_reg_base, nRegValue);
}
  /* check if ch2 is enabled */
Adpd400xDrvRegRead(ADPD400x_REG_TS_CTRL_A + g_adpd_reg_base, &nTsCtrl);
nCh2Enable = (nTsCtrl & BITM_TS_CTRL_A_CH2_EN_A) >> BITP_TS_CTRL_A_CH2_EN_A;
Adpd400xDrvRegRead(ADPD400x_REG_AFE_TRIM_A + g_adpd_reg_base, &nTIAgain);
if((nGainValue & BITM_AFE_TRIM_X_TIA_GAIN_CH1_X) <= CH1_GAIN_MAX_REG_VAL){//the maximum value of ch1 gain settings will be 4
nTIAgain = nTIAgain & (~BITM_AFE_TRIM_X_TIA_GAIN_CH1_X);
nTIAgain |= (nGainValue & BITM_AFE_TRIM_X_TIA_GAIN_CH1_X) << BITP_AFE_TRIM_X_TIA_GAIN_CH1_X;
}
if(nCh2Enable)
{
  if((nGainValue & BITM_AFE_TRIM_X_TIA_GAIN_CH2_X) <= CH2_GAIN_MAX_REG_VAL){ //the maximum value of ch2 gain settings will be 32
  nTIAgain = nTIAgain & (~BITM_AFE_TRIM_X_TIA_GAIN_CH2_X);
  nTIAgain |= (nGainValue & BITM_AFE_TRIM_X_TIA_GAIN_CH2_X);
  }
}
Adpd400xDrvRegWrite(ADPD400x_REG_AFE_TRIM_A + g_adpd_reg_base, nTIAgain);
Adpd400xDrvSetOperationMode(ADPD400xDrv_MODE_SAMPLE);
}
#endif